STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253axx_cm33.h
/**
  ******************************************************************************
  * @file    stm32mp253axx_cm33.h
  * @author  MCD Application Team
  * @brief   CMSIS stm32mp253axx_cm33 Device Peripheral Access Layer Header File.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral registers declarations and bits definition
  *           - Macros to access peripherals registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2022 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS_Device
  * @{
  */

/** @addtogroup stm32mp253axx_cm33
  * @{
  */

#ifndef __STM32MP253Axx_CM33_H
#define __STM32MP253Axx_CM33_H

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */

 /**
 * @brief stm32mp2_m33 Interrupt Number Definition :
 *        - according to the selected device in @ref Library_configuration_section
 *        - according to "Table 232. interrupt mapping for Cortex-M33"
 *          in chapitre 32 "interrupt list" of reference document
 *          RM0457 - Reference Manual - STM32MP25xx - advanced ARM-based 32/64-bit MPUs
 *          file "DM00485804 (RM0457) Rev0.2.pdf" (Revision 0.2 / 27-Jul-2021)
 */

 typedef enum
  {
  /******  Cortex-M Processor Exceptions Numbers ***********************************************/
    NonMaskableInt_IRQn         = -14,  /*!< 2 Non Maskable Interrupt                          */
    HardFault_IRQn              = -13,  /*!< 3 Cortex-M Hard Fault Interrupt                   */
    MemoryManagement_IRQn       = -12,  /*!< 4 Cortex-M Memory Management Interrupt            */
    BusFault_IRQn               = -11,  /*!< 5 Cortex-M Bus Fault Interrupt                    */
    UsageFault_IRQn             = -10,  /*!< 6 Cortex-M Usage Fault Interrupt                  */
    SecureFault_IRQn            = -9,   /*!< 7 Cortex-M Secure Fault Interrupt                 */
    SVCall_IRQn                 = -5,   /*!< 11 Cortex-M SV Call Interrupt                     */
    DebugMonitor_IRQn           = -4,   /*!< 12 Cortex-M Debug Monitor Interrupt               */
    PendSV_IRQn                 = -2,   /*!< 14 Cortex-M Pend SV Interrupt                     */
    SysTick_IRQn                = -1,   /*!< 15 Cortex-M System Tick Interrupt                 */
  /******  STM32 specific Interrupt Numbers ****************************************************/
    PVD_IRQn                    = 0,    /*!< PVD detector through EXTI                         */
    PVM_IRQn                    = 1,    /*!< PVM detector through EXTI                         */
    IWDG3_IRQn                  = 2,    /*!< Independent Watchdog 3 Early wake interrupt       */
    IWDG4_IRQn                  = 3,    /*!< Independent Watchdog 4 Early wake interrupt       */
    IWDG1_RST_IRQn              = 4,    /*!< Independent Watchdog 1 Reset through EXTI         */
    IWDG2_RST_IRQn              = 5,    /*!< Independent Watchdog 2 Reset through EXTI         */
    IWDG4_RST_IRQn              = 6,    /*!< Independent Watchdog 4 Reset through EXTI         */
    IWDG5_RST_IRQn              = 7,    /*!< Independent Watchdog 5 Reset through EXTI         */
    WWDG1_IRQn                  = 8,    /*!< Window Watchdog 1 Early Wakeup interrupt          */
    RESERVED_9                  = 9,    /*!< reserved                                          */
    RESERVED_10                 = 10,   /*!< reserved                                          */
    WWDG2_RST_IRQn              = 11,   /*!< Independent Watchdog 2 Reset through EXTI         */
    TAMP_IRQn                   = 12,   /*!< Tamper interrupt (include LSECSS interrupts)      */
    RTC_IRQn                    = 13,   /*!< RTC global interrupt                              */
    TAMP_S_IRQn                 = 14,   /*!< Tamper interrupt (include LSECSS interrupts)      */
    RTC_S_IRQn                  = 15,   /*!< RTC global secure interrupt                       */
    RCC_IRQn                    = 16,   /*!< RCC global interrupt                              */
    EXTI2_0_IRQn                = 17,   /*!< EXTI2 Line 0 interrupt                            */
    EXTI2_1_IRQn                = 18,   /*!< EXTI2 Line 1 interrupt                            */
    EXTI2_2_IRQn                = 19,   /*!< EXTI2 Line 2 interrupt                            */
    EXTI2_3_IRQn                = 20,   /*!< EXTI2 Line 3 interrupt                            */
    EXTI2_4_IRQn                = 21,   /*!< EXTI2 Line 4 interrupt                            */
    EXTI2_5_IRQn                = 22,   /*!< EXTI2 Line 5 interrupt                            */
    EXTI2_6_IRQn                = 23,   /*!< EXTI2 Line 6 interrupt                            */
    EXTI2_7_IRQn                = 24,   /*!< EXTI2 Line 7 interrupt                            */
    EXTI2_8_IRQn                = 25,   /*!< EXTI2 Line 8 interrupt                            */
    EXTI2_9_IRQn                = 26,   /*!< EXTI2 Line 9 interrupt                            */
    EXTI2_10_IRQn               = 27,   /*!< EXTI2 Line 10 interrupt                           */
    EXTI2_11_IRQn               = 28,   /*!< EXTI2 Line 11 interrupt                           */
    EXTI2_12_IRQn               = 29,   /*!< EXTI2 Line 12 interrupt                           */
    EXTI2_13_IRQn               = 30,   /*!< EXTI2 Line 13 interrupt                           */
    EXTI2_14_IRQn               = 31,   /*!< EXTI2 Line 14 interrupt                           */
    EXTI2_15_IRQn               = 32,   /*!< EXTI2 Line 15 interrupt                           */
    HPDMA1_Channel0_IRQn        = 33,   /*!< HPDMA1 Channel0 interrupt                         */
    HPDMA1_Channel1_IRQn        = 34,   /*!< HPDMA1 Channel1 interrupt                         */
    HPDMA1_Channel2_IRQn        = 35,   /*!< HPDMA1 Channel2 interrupt                         */
    HPDMA1_Channel3_IRQn        = 36,   /*!< HPDMA1 Channel3 interrupt                         */
    HPDMA1_Channel4_IRQn        = 37,   /*!< HPDMA1 Channel4 interrupt                         */
    HPDMA1_Channel5_IRQn        = 38,   /*!< HPDMA1 Channel5 interrupt                         */
    HPDMA1_Channel6_IRQn        = 39,   /*!< HPDMA1 Channel6 interrupt                         */
    HPDMA1_Channel7_IRQn        = 40,   /*!< HPDMA1 Channel7 interrupt                         */
    HPDMA1_Channel8_IRQn        = 41,   /*!< HPDMA1 Channel8 interrupt                         */
    HPDMA1_Channel9_IRQn        = 42,   /*!< HPDMA1 Channel9 interrupt                         */
    HPDMA1_Channel10_IRQn       = 43,   /*!< HPDMA1 Channel10 interrupt                        */
    HPDMA1_Channel11_IRQn       = 44,   /*!< HPDMA1 Channel11 interrupt                        */
    HPDMA1_Channel12_IRQn       = 45,   /*!< HPDMA1 Channel12 interrupt                        */
    HPDMA1_Channel13_IRQn       = 46,   /*!< HPDMA1 Channel13 interrupt                        */
    HPDMA1_Channel14_IRQn       = 47,   /*!< HPDMA1 Channel14 interrupt                        */
    HPDMA1_Channel15_IRQn       = 48,   /*!< HPDMA1 Channel15 interrupt                        */
    HPDMA2_Channel0_IRQn        = 49,   /*!< HPDMA2 Channel0 interrupt                         */
    HPDMA2_Channel1_IRQn        = 50,   /*!< HPDMA2 Channel1 interrupt                         */
    HPDMA2_Channel2_IRQn        = 51,   /*!< HPDMA2 Channel2 interrupt                         */
    HPDMA2_Channel3_IRQn        = 52,   /*!< HPDMA2 Channel3 interrupt                         */
    HPDMA2_Channel4_IRQn        = 53,   /*!< HPDMA2 Channel4 interrupt                         */
    HPDMA2_Channel5_IRQn        = 54,   /*!< HPDMA2 Channel5 interrupt                         */
    HPDMA2_Channel6_IRQn        = 55,   /*!< HPDMA2 Channel6 interrupt                         */
    HPDMA2_Channel7_IRQn        = 56,   /*!< HPDMA2 Channel7 interrupt                         */
    HPDMA2_Channel8_IRQn        = 57,   /*!< HPDMA2 Channel8 interrupt                         */
    HPDMA2_Channel9_IRQn        = 58,   /*!< HPDMA2 Channel9 interrupt                         */
    HPDMA2_Channel10_IRQn       = 59,   /*!< HPDMA2 Channel10 interrupt                        */
    HPDMA2_Channel11_IRQn       = 60,   /*!< HPDMA2 Channel11 interrupt                        */
    HPDMA2_Channel12_IRQn       = 61,   /*!< HPDMA2 Channel12 interrupt                        */
    HPDMA2_Channel13_IRQn       = 62,   /*!< HPDMA2 Channel13 interrupt                        */
    HPDMA2_Channel14_IRQn       = 63,   /*!< HPDMA2 Channel14 interrupt                        */
    HPDMA2_Channel15_IRQn       = 64,   /*!< HPDMA2 Channel15 interrupt                        */
    HPDMA3_Channel0_IRQn        = 65,   /*!< HPDMA3 Channel0 interrupt                         */
    HPDMA3_Channel1_IRQn        = 66,   /*!< HPDMA3 Channel1 interrupt                         */
    HPDMA3_Channel2_IRQn        = 67,   /*!< HPDMA3 Channel2 interrupt                         */
    HPDMA3_Channel3_IRQn        = 68,   /*!< HPDMA3 Channel3 interrupt                         */
    HPDMA3_Channel4_IRQn        = 69,   /*!< HPDMA3 Channel4 interrupt                         */
    HPDMA3_Channel5_IRQn        = 70,   /*!< HPDMA3 Channel5 interrupt                         */
    HPDMA3_Channel6_IRQn        = 71,   /*!< HPDMA3 Channel6 interrupt                         */
    HPDMA3_Channel7_IRQn        = 72,   /*!< HPDMA3 Channel7 interrupt                         */
    HPDMA3_Channel8_IRQn        = 73,   /*!< HPDMA3 Channel8 interrupt                         */
    HPDMA3_Channel9_IRQn        = 74,   /*!< HPDMA3 Channel9 interrupt                         */
    HPDMA3_Channel10_IRQn       = 75,   /*!< HPDMA3 Channel10 interrupt                        */
    HPDMA3_Channel11_IRQn       = 76,   /*!< HPDMA3 Channel11 interrupt                        */
    HPDMA3_Channel12_IRQn       = 77,   /*!< HPDMA3 Channel12 interrupt                        */
    HPDMA3_Channel13_IRQn       = 78,   /*!< HPDMA3 Channel13 interrupt                        */
    HPDMA3_Channel14_IRQn       = 79,   /*!< HPDMA3 Channel14 interrupt                        */
    HPDMA3_Channel15_IRQn       = 80,   /*!< HPDMA3 Channel15 interrupt                        */
    LPDMA_Channel0_IRQn         = 81,   /*!< LPDMA Channel0 interrupt                          */
    LPDMA_Channel1_IRQn         = 82,   /*!< LPDMA Channel1 interrupt                          */
    LPDMA_Channel2_IRQn         = 83,   /*!< LPDMA Channel2 interrupt                          */
    LPDMA_Channel3_IRQn         = 84,   /*!< LPDMA Channel3 interrupt                          */
    ICACHE_IRQn                 = 85,   /*!< ICACHE interrupt                                  */
    DCACHE_IRQn                 = 86,   /*!< DCACHE interrupt                                  */
    ADC1_IRQn                   = 87,   /*!< ADC1 interrupt                                    */
    ADC2_IRQn                   = 88,   /*!< ADC2 interrupt                                    */
    ADC3_IRQn                   = 89,   /*!< ADC3 interrupt                                    */
    FDCAN_CAL_IRQn              = 90,   /*!< FDCAN CCU interrupt                               */
    FDCAN1_IT0_IRQn             = 91,   /*!< FDCAN1 interrupt 0                                */
    FDCAN2_IT0_IRQn             = 92,   /*!< FDCAN2 interrupt 0                                */
    FDCAN3_IT0_IRQn             = 93,   /*!< FDCAN3 interrupt 0                                */
    FDCAN1_IT1_IRQn             = 94,   /*!< FDCAN1 interrupt 1                                */
    FDCAN2_IT1_IRQn             = 95,   /*!< FDCAN2 interrupt 1                                */
    FDCAN3_IT1_IRQn             = 96,   /*!< FDCAN3 interrupt 1                                */
    TIM1_BRK_IRQn               = 97,   /*!< TIM1 Break interrupt                              */
    TIM1_UP_IRQn                = 98,   /*!< TIM1 Update interrupt                             */
    TIM1_TRG_COM_IRQn           = 99,   /*!< TIM1 Trigger and Commutation interrupts           */
    TIM1_CC_IRQn                = 100,  /*!< TIM1 Capture Compare interrupt                    */
    TIM20_BRK_IRQn              = 101,  /*!< TIM20 Break interrupt                             */
    TIM20_UP_IRQn               = 102,  /*!< TIM20 Update interrupt                            */
    TIM20_TRG_COM_IRQn          = 103,  /*!< TIM20 Trigger and Commutation interrupts          */
    TIM20_CC_IRQn               = 104,  /*!< TIM20 Capture Compare interrupt                   */
    TIM2_IRQn                   = 105,  /*!< TIM2 interrupt                                    */
    TIM3_IRQn                   = 106,  /*!< TIM3 interrupt                                    */
    TIM4_IRQn                   = 107,  /*!< TIM4 interrupt                                    */
    I2C1_IRQn                   = 108,  /*!< I2C1 global interrupt                             */
    I3C1_IRQn                   = 109,  /*!< I3C1 global interrupt                             */
    I2C2_IRQn                   = 110,  /*!< I2C2 global interrupt                             */
    I3C2_IRQn                   = 111,  /*!< I3C2 global interrupt                             */
    SPI1_IRQn                   = 112,  /*!< SPI1 global interrupt                             */
    SPI2_IRQn                   = 113,  /*!< SPI2 global interrupt                             */
    USART1_IRQn                 = 114,  /*!< USART1 global interrupt                           */
    USART2_IRQn                 = 115,  /*!< USART2 global interrupt                           */
    USART3_IRQn                 = 116,  /*!< USART3 global interrupt                           */
   RESERVED_117                 = 117,  /*!< reserved                                          */
    TIM8_BRK_IRQn               = 118,  /*!< TIM8 Break interrupt                              */
    TIM8_UP_IRQn                = 119,  /*!< TIM8 Update interrupt                             */
    TIM8_TRG_COM_IRQn           = 120,  /*!< TIM8 Trigger and Commutation interrupts           */
    TIM8_CC_IRQn                = 121,  /*!< TIM8 Capture Compare interrupt                    */
    FMC_IRQn                    = 122,  /*!< FMC global interrupt                              */
    SDMMC1_IRQn                 = 123,  /*!< SDMMC1 global interrupt                           */
    TIM5_IRQn                   = 124,  /*!< TIM5 global interrupt                             */
    SPI3_IRQn                   = 125,  /*!< SPI3 global interrupt                             */
    UART4_IRQn                  = 126,  /*!< UART4 global interrupt                            */
    UART5_IRQn                  = 127,  /*!< UART5 global interrupt                            */
    TIM6_IRQn                   = 128,  /*!< TIM6 interrupt                                    */
    TIM7_IRQn                   = 129,  /*!< TIM7 interrupt                                    */
    ETH1_SBD_IRQn               = 130,  /*!< ETH1 global interrupt                             */
    ETH1_PMT_IRQn               = 131,  /*!< ETH1 wake-up interrupt                            */
    ETH1_LPI_IRQn               = 132,  /*!< ETH1 LPI interrupt                                */
    ETH2_SBD_IRQn               = 133,  /*!< ETH2 global interrupt                             */
    ETH2_PMT_IRQn               = 134,  /*!< ETH2 wake-up interrupt (PMT)                      */
    ETH2_LPI_IRQn               = 135,  /*!< ETH2 LPI interrupt                                */
    USART6_IRQn                 = 136,  /*!< USART6 global interrupt                           */
    I2C3_IRQn                   = 137,  /*!< I2C3 global interrupt                             */
    I3C3_IRQn                   = 138,  /*!< I3C3 global interrupt                             */
    USBH_EHCI_IRQn              = 139,  /*!< USB Host EHCI interrupt                           */
    USBH_OHCI_IRQn              = 140,  /*!< USB Host OHCI interrupt                           */
    DCMI_PSSI_IRQn              = 141,  /*!< DCMI & PSSI global interrupt                      */
    CSI_IRQn                    = 142,  /*!< CSI interrupt                                     */
    DSI_IRQn                    = 143,  /*!< DSI Host controller global interrupt              */
    RESERVED_144                = 144,  /*!< reserved                                          */
    HASH_IRQn                   = 145,  /*!< HASH interrupt                                    */
    PKA_IRQn                    = 146,  /*!< PKA interrupt                                     */
    FPU_IRQn                    = 147,  /*!< FPU global interrupt                              */
    UART7_IRQn                  = 148,  /*!< UART7 global interrupt                            */
    UART8_IRQn                  = 149,  /*!< UART8 global interrupt                            */
    UART9_IRQn                  = 150,  /*!< UART9 global interrupt                            */
    LPUART1_IRQn                = 151,  /*!< LPUART1 global interrupt                          */
    SPI4_IRQn                   = 152,  /*!< SPI4 global interrupt                             */
    SPI5_IRQn                   = 153,  /*!< SPI5 global interrupt                             */
    SPI6_IRQn                   = 154,  /*!< SPI6 global interrupt                             */
    SPI7_IRQn                   = 155,  /*!< SPI7 global interrupt                             */
    SPI8_IRQn                   = 156,  /*!< SPI8 global interrupt                             */
    SAI1_IRQn                   = 157,  /*!< SAI1 global interrupt                             */
    LTDC_IRQn                   = 158,  /*!< LTDC global interrupt                             */
    LTDC_ER_IRQn                = 159,  /*!< LTDC global error interrupt                       */
    LTDC_SEC_IRQn               = 160,  /*!< LTDC security global interrupt                    */
    LTDC_SEC_ER_IRQn            = 161,  /*!< LTDC security global error interrupt              */
    SAI2_IRQn                   = 162,  /*!< SAI2 global interrupt                             */
    OCTOSPI1_IRQn               = 163,  /*!< OCTOSPI1 global interrupt                         */
    OCTOSPI2_IRQn               = 164,  /*!< OCTOSPI2 global interrupt                         */
    RESERVED_165                = 165,  /*!< reserved                                          */
    LPTIM1_IRQn                 = 166,  /*!< LPTIMER1 interrupt                                */
    RESERVED_167                = 167,  /*!< reserved                                          */
    I2C4_IRQn                   = 168,  /*!< I2C4 global interrupt                             */
    USBH_WAKEUP_IRQn            = 169,  /*!< USB Host remote wake up from USB2PHY1 interrupt   */
    SPDIFRX_IRQn                = 170,  /*!< SPDIFRX global interrupt                          */
    IPCC1_RX_IRQn               = 171,  /*!< Mailbox 1 RX Occupied interrupt                   */
    IPCC1_TX_IRQn               = 172,  /*!< Mailbox 1 TX Free interrupt                       */
    IPCC1_RX_S_IRQn             = 173,  /*!< Mailbox 1 RX Occupied secure interrupt            */
    IPCC1_TX_S_IRQn             = 174,  /*!< Mailbox 1 TX Free secure interrupt                */
    IPCC2_RX_IRQn               = 175,  /*!< Mailbox 2 RX Occupied interrupt                   */
    IPCC2_TX_IRQn               = 176,  /*!< Mailbox 2 TX Free interrupt                       */
    IPCC2_RX_S_IRQn             = 177,  /*!< Mailbox 2 RX Occupied secure interrupt            */
    IPCC2_TX_S_IRQn             = 178,  /*!< Mailbox 2 TX Free secure interrupt                */
    RESERVED_179                = 179,  /*!< reserved                                          */
    RESERVED_180                = 180,  /*!< reserved                                          */
    I2C5_IRQn                   = 181,  /*!< I2C5 global interrupt                             */
    USB3DR_WAKEUP_IRQn          = 182,  /*!< USB3 remote wake up from USB2PHY1 interrupt       */
    RESERVED_183                = 183,  /*!< reserved                                          */
    MDF1_FLT0_IRQn              = 184,  /*!< MDF1 Filter0 interrupt                            */
    MDF1_FLT1_IRQn              = 185,  /*!< MDF1 Filter1 interrupt                            */
    MDF1_FLT2_IRQn              = 186,  /*!< MDF1 Filter2 interrupt                            */
    MDF1_FLT3_IRQn              = 187,  /*!< MDF1 Filter3 interrupt                            */
    MDF1_FLT4_IRQn              = 188,  /*!< MDF1 Filter4 interrupt                            */
    MDF1_FLT5_IRQn              = 189,  /*!< MDF1 Filter5 interrupt                            */
    MDF1_FLT6_IRQn              = 190,  /*!< MDF1 Filter6 interrupt                            */
    MDF1_FLT7_IRQn              = 191,  /*!< MDF1 Filter7 interrupt                            */
    SAI3_IRQn                   = 192,  /*!< SAI3 global interrupt                             */
    TIM15_IRQn                  = 193,  /*!< TIMER15 global interrupt                          */
    TIM16_IRQn                  = 194,  /*!< TIMER16 global interrupt                          */
    TIM17_IRQn                  = 195,  /*!< TIMER17 global interrupt                          */
    TIM12_IRQn                  = 196,  /*!< TIMER12 global interrupt                          */
    SDMMC2_IRQn                 = 197,  /*!< SDMMC2 global interrupt                           */
    DCMIPP_IRQn                 = 198,  /*!< DCMIPP global interrupt                           */
    HSEM_IRQn                   = 199,  /*!< HSEM nonsecure interrupt                          */
    HSEM_S_IRQn                 = 200,  /*!< HSEM secure interrupt                             */
