STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253axx_cm33.h
#define RAMCFG_SYSRAM               RAMCFG_SYSRAM_S
#define RAMCFG_SYSRAM_BASE          RAMCFG_SYSRAM_BASE_S

#define RAMCFG_SRAM1                RAMCFG_SRAM1_S
#define RAMCFG_SRAM1_BASE           RAMCFG_SRAM1_BASE_S

#define RAMCFG_SRAM2                RAMCFG_SRAM2_S
#define RAMCFG_SRAM2_BASE           RAMCFG_SRAM2_BASE_S

#define RAMCFG_RETRAM               RAMCFG_RETRAM_S
#define RAMCFG_RETRAM_BASE          RAMCFG_RETRAM_BASE_S

#define RAMCFG_LPSRAM1              RAMCFG_LPSRAM1_S
#define RAMCFG_LPSRAM1_BASE         RAMCFG_LPSRAM1_BASE_S

#define RAMCFG_LPSRAM2              RAMCFG_LPSRAM2_S
#define RAMCFG_LPSRAM2_BASE         RAMCFG_LPSRAM2_BASE_S

#define RAMCFG_LPSRAM3              RAMCFG_LPSRAM3_S
#define RAMCFG_LPSRAM3_BASE         RAMCFG_LPSRAM3_BASE_S

#define RAMCFG_BKPSRAM              RAMCFG_BKPSRAM_S
#define RAMCFG_BKPSRAM_BASE         RAMCFG_BKPSRAM_BASE_S

#define RAMCFG_VDERAM               RAMCFG_VDERAM_S
#define RAMCFG_VDERAM_BASE          RAMCFG_VDERAM_BASE_S

#define RIFSC                       RIFSC_S
#define RIFSC_BASE                  RIFSC_BASE_S

#define RISC                        RISC_S
#define RISC_BASE                   RISC_BASE_S

#define RIMC                        RIMC_S
#define RIMC_BASE                   RIMC_BASE_S

#define RIFSC_ID                    RIFSC_ID_S
#define RIFSC_ID_BASE               RIFSC_ID_BASE_S

#define IAC                         IAC_S
#define IAC_BASE                    IAC_BASE_S

#define RISAF1                      RISAF1_S
#define RISAF1_BASE                 RISAF1_BASE_S

#define RISAF2                      RISAF2_S
#define RISAF2_BASE                 RISAF2_BASE_S

#define RISAF4                      RISAF4_S
#define RISAF4_BASE                 RISAF4_BASE_S

#define RISAF5                      RISAF5_S
#define RISAF5_BASE                 RISAF5_BASE_S

#define RISAB1                      RISAB1_S
#define RISAB1_BASE                 RISAB1_BASE_S

#define RISAB2                      RISAB2_S
#define RISAB2_BASE                 RISAB2_BASE_S

#define RISAB3                      RISAB3_S
#define RISAB3_BASE                 RISAB3_BASE_S

#define RISAB4                      RISAB4_S
#define RISAB4_BASE                 RISAB4_BASE_S

#define RISAB5                      RISAB5_S
#define RISAB5_BASE                 RISAB5_BASE_S

#define RISAB6                      RISAB6_S
#define RISAB6_BASE                 RISAB6_BASE_S

/*!< APB3 peripherals defaults to Secure aliases */
#define BSEC                        BSEC_S
#define BSEC_BASE                   BSEC_BASE_S

#define IWDG1                       IWDG1_S
#define IWDG1_BASE                  IWDG1_BASE_S

#define IWDG2                       IWDG2_S
#define IWDG2_BASE                  IWDG2_BASE_S

#define IWDG3                       IWDG3_S
#define IWDG3_BASE                  IWDG3_BASE_S

#define IWDG4                       IWDG4_S
#define IWDG4_BASE                  IWDG4_BASE_S

#define WWDG1                       WWDG1_S
#define WWDG1_BASE                  WWDG1_BASE_S

#define VREFBUF                     VREFBUF_S
#define VREFBUF_BASE                VREFBUF_BASE_S

#define DTS                         DTS_S
#define DTS_BASE                    DTS_BASE_S

#define SERC                        SERC_S
#define SERC_BASE                   SERC_BASE_S

#define HDP                         HDP_S
#define HDP_BASE                    HDP_BASE_S

/*!< AHB4 peripherals defaults to Secure aliases */
#define RCC                         RCC_S
#define RCC_BASE                    RCC_BASE_S

#define PWR                         PWR_S
#define PWR_BASE                    PWR_BASE_S

#define EXTI1                       EXTI1_S
#define EXTI1_BASE                  EXTI1_BASE_S

#define EXTI1_C1                    EXTI1_C1_S
#define EXTI1_C1_BASE               EXTI1_C1_BASE_S

#define EXTI1_C2                    EXTI1_C2_S
#define EXTI1_C2_BASE               EXTI1_C2_BASE_S

#define SYSCFG                      SYSCFG_S
#define SYSCFG_BASE                 SYSCFG_BASE_S

#define GPIOA                       GPIOA_S
#define GPIOA_BASE                  GPIOA_BASE_S

#define GPIOB                       GPIOB_S
#define GPIOB_BASE                  GPIOB_BASE_S

#define GPIOC                       GPIOC_S
#define GPIOC_BASE                  GPIOC_BASE_S

#define GPIOD                       GPIOD_S
#define GPIOD_BASE                  GPIOD_BASE_S

#define GPIOE                       GPIOE_S
#define GPIOE_BASE                  GPIOE_BASE_S

#define GPIOF                       GPIOF_S
#define GPIOF_BASE                  GPIOF_BASE_S

#define GPIOG                       GPIOG_S
#define GPIOG_BASE                  GPIOG_BASE_S

#define GPIOH                       GPIOH_S
#define GPIOH_BASE                  GPIOH_BASE_S

#define GPIOI                       GPIOI_S
#define GPIOI_BASE                  GPIOI_BASE_S

#define GPIOJ                       GPIOJ_S
#define GPIOJ_BASE                  GPIOJ_BASE_S

#define GPIOK                       GPIOK_S
#define GPIOK_BASE                  GPIOK_BASE_S

/*!< SMART_RUN_APB peripherals defaults to Secure aliases */
#define RTC                         RTC_S
#define RTC_BASE                    RTC_BASE_S

#define TAMP                        TAMP_S
#define TAMP_BASE                   TAMP_BASE_S

#define SPI8                        SPI8_S
#define SPI8_BASE                   SPI8_BASE_S

#define LPUART1                     LPUART1_S
#define LPUART1_BASE                LPUART1_BASE_S

#define I2C8                        I2C8_S
#define I2C8_BASE                   I2C8_BASE_S

#define LPTIM3                      LPTIM3_S
#define LPTIM3_BASE                 LPTIM3_BASE_S

#define LPTIM4                      LPTIM4_S
#define LPTIM4_BASE                 LPTIM4_BASE_S

#define LPTIM5                      LPTIM5_S
#define LPTIM5_BASE                 LPTIM5_BASE_S

#define I3C4                        I3C4_S
#define I3C4_BASE                   I3C4_BASE_S

#define IWDG5                       IWDG5_S
#define IWDG5_BASE                  IWDG5_BASE_S

#define WWDG2                       WWDG2_S
#define WWDG2_BASE                  WWDG2_BASE_S

/*!< SMART_RUN_AHB peripherals defaults to Secure aliases */
#define GPIOZ                       GPIOZ_S
#define GPIOZ_BASE                  GPIOZ_BASE_S

#define LPDMA                       LPDMA_S
#define LPDMA_BASE                  LPDMA_BASE_S

#define ADF1                        ADF1_S
#define ADF1_BASE                   ADF1_BASE_S

#define ADF1_Filter0                ADF1_Filter0_S
#define ADF1_Filter0_BASE                   ADF1_Filter0_BASE_S

