STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253axx_cm33.h
/*************  Bit definition for ETH_DMAA4DACR register  *************/
#define ETH_DMAA4DACR_TDWC_Pos              (0U)
#define ETH_DMAA4DACR_TDWC_Msk              (0xFUL << ETH_DMAA4DACR_TDWC_Pos)                    /*!< 0x0000000F */
#define ETH_DMAA4DACR_TDWC                  ETH_DMAA4DACR_TDWC_Msk                              /*!< Transmit DMA Write Descriptor Cache control */
#define ETH_DMAA4DACR_TDWC_0                (0x1UL << ETH_DMAA4DACR_TDWC_Pos)                    /*!< 0x00000001 */
#define ETH_DMAA4DACR_TDWC_1                (0x2UL << ETH_DMAA4DACR_TDWC_Pos)                    /*!< 0x00000002 */
#define ETH_DMAA4DACR_TDWC_2                (0x4UL << ETH_DMAA4DACR_TDWC_Pos)                    /*!< 0x00000004 */
#define ETH_DMAA4DACR_TDWC_3                (0x8UL << ETH_DMAA4DACR_TDWC_Pos)                    /*!< 0x00000008 */
#define ETH_DMAA4DACR_TDWD_Pos              (4U)
#define ETH_DMAA4DACR_TDWD_Msk              (0x3UL << ETH_DMAA4DACR_TDWD_Pos)                    /*!< 0x00000030 */
#define ETH_DMAA4DACR_TDWD                  ETH_DMAA4DACR_TDWD_Msk                              /*!< Transmit DMA Write Descriptor Domain control */
#define ETH_DMAA4DACR_TDWD_0                (0x1UL << ETH_DMAA4DACR_TDWD_Pos)                    /*!< 0x00000010 */
#define ETH_DMAA4DACR_TDWD_1                (0x2UL << ETH_DMAA4DACR_TDWD_Pos)                    /*!< 0x00000020 */
#define ETH_DMAA4DACR_RDRC_Pos              (8U)
#define ETH_DMAA4DACR_RDRC_Msk              (0xFUL << ETH_DMAA4DACR_RDRC_Pos)                    /*!< 0x00000F00 */
#define ETH_DMAA4DACR_RDRC                  ETH_DMAA4DACR_RDRC_Msk                              /*!< Receive DMA Read Descriptor Cache control */
#define ETH_DMAA4DACR_RDRC_0                (0x1UL << ETH_DMAA4DACR_RDRC_Pos)                    /*!< 0x00000100 */
#define ETH_DMAA4DACR_RDRC_1                (0x2UL << ETH_DMAA4DACR_RDRC_Pos)                    /*!< 0x00000200 */
#define ETH_DMAA4DACR_RDRC_2                (0x4UL << ETH_DMAA4DACR_RDRC_Pos)                    /*!< 0x00000400 */
#define ETH_DMAA4DACR_RDRC_3                (0x8UL << ETH_DMAA4DACR_RDRC_Pos)                    /*!< 0x00000800 */

/*****************  Bit definition for ETH_DMALPIEI register  *****************/
#define ETH_DMALPIEI_LPIEI_Pos              (0U)
#define ETH_DMALPIEI_LPIEI_Msk              (0xFUL << ETH_DMALPIEI_LPIEI_Pos)                    /*!< 0x0000000F */
#define ETH_DMALPIEI_LPIEI                  ETH_DMALPIEI_LPIEI_Msk                              /*!< LPI Entry Interval */

/***************  Bit definition for ETH_DMATBSCTRL0R register  ***************/
#define ETH_DMATBSCTRL0R_FTOV_Pos           (0U)
#define ETH_DMATBSCTRL0R_FTOV_Msk           (0x1UL << ETH_DMATBSCTRL0R_FTOV_Pos)                 /*!< 0x00000001 */
#define ETH_DMATBSCTRL0R_FTOV               ETH_DMATBSCTRL0R_FTOV_Msk                           /*!< Fetch time offset valid */
#define ETH_DMATBSCTRL0R_FGOS_Pos           (4U)
#define ETH_DMATBSCTRL0R_FGOS_Msk           (0x7UL << ETH_DMATBSCTRL0R_FGOS_Pos)                 /*!< 0x00000070 */
#define ETH_DMATBSCTRL0R_FGOS               ETH_DMATBSCTRL0R_FGOS_Msk                           /*!< Fetch GSN offset */
#define ETH_DMATBSCTRL0R_FTOS_Pos           (8U)
#define ETH_DMATBSCTRL0R_FTOS_Msk           (0xFFFFFFUL << ETH_DMATBSCTRL0R_FTOS_Pos)            /*!< 0xFFFFFF00 */
#define ETH_DMATBSCTRL0R_FTOS               ETH_DMATBSCTRL0R_FTOS_Msk                           /*!< Fetch time offset */

/***************  Bit definition for ETH_DMATBSCTRL1R register  ***************/
#define ETH_DMATBSCTRL1R_FTOV_Pos           (0U)
#define ETH_DMATBSCTRL1R_FTOV_Msk           (0x1UL << ETH_DMATBSCTRL1R_FTOV_Pos)                 /*!< 0x00000001 */
#define ETH_DMATBSCTRL1R_FTOV               ETH_DMATBSCTRL1R_FTOV_Msk                           /*!< Fetch time offset valid */
#define ETH_DMATBSCTRL1R_FGOS_Pos           (4U)
#define ETH_DMATBSCTRL1R_FGOS_Msk           (0x7UL << ETH_DMATBSCTRL1R_FGOS_Pos)                 /*!< 0x00000070 */
#define ETH_DMATBSCTRL1R_FGOS               ETH_DMATBSCTRL1R_FGOS_Msk                           /*!< Fetch GSN offset */
#define ETH_DMATBSCTRL1R_FTOS_Pos           (8U)
#define ETH_DMATBSCTRL1R_FTOS_Msk           (0xFFFFFFUL << ETH_DMATBSCTRL1R_FTOS_Pos)            /*!< 0xFFFFFF00 */
#define ETH_DMATBSCTRL1R_FTOS               ETH_DMATBSCTRL1R_FTOS_Msk                           /*!< Fetch time offset */

/***************  Bit definition for ETH_DMATBSCTRL2R register  ***************/
#define ETH_DMATBSCTRL2R_FTOV_Pos           (0U)
#define ETH_DMATBSCTRL2R_FTOV_Msk           (0x1UL << ETH_DMATBSCTRL2R_FTOV_Pos)                  /*!< 0x00000001 */
#define ETH_DMATBSCTRL2R_FTOV               ETH_DMATBSCTRL2R_FTOV_Msk                           /*!< Fetch time offset valid */
#define ETH_DMATBSCTRL2R_FGOS_Pos           (4U)
#define ETH_DMATBSCTRL2R_FGOS_Msk           (0x7UL << ETH_DMATBSCTRL2R_FGOS_Pos)                  /*!< 0x00000070 */
#define ETH_DMATBSCTRL2R_FGOS               ETH_DMATBSCTRL2R_FGOS_Msk                           /*!< Fetch GSN offset */
#define ETH_DMATBSCTRL2R_FTOS_Pos           (8U)
#define ETH_DMATBSCTRL2R_FTOS_Msk           (0xFFFFFFUL << ETH_DMATBSCTRL2R_FTOS_Pos)             /*!< 0xFFFFFF00 */
#define ETH_DMATBSCTRL2R_FTOS               ETH_DMATBSCTRL2R_FTOS_Msk                           /*!< Fetch time offset */

/***************  Bit definition for ETH_DMATBSCTRL3R register  ***************/
#define ETH_DMATBSCTRL3R_FTOV_Pos           (0U)
#define ETH_DMATBSCTRL3R_FTOV_Msk           (0x1UL << ETH_DMATBSCTRL3R_FTOV_Pos)                  /*!< 0x00000001 */
#define ETH_DMATBSCTRL3R_FTOV               ETH_DMATBSCTRL3R_FTOV_Msk                           /*!< Fetch time offset valid */
#define ETH_DMATBSCTRL3R_FGOS_Pos           (4U)
#define ETH_DMATBSCTRL3R_FGOS_Msk           (0x7UL << ETH_DMATBSCTRL3R_FGOS_Pos)                  /*!< 0x00000070 */
#define ETH_DMATBSCTRL3R_FGOS               ETH_DMATBSCTRL3R_FGOS_Msk                           /*!< Fetch GSN offset */
#define ETH_DMATBSCTRL3R_FTOS_Pos           (8U)
#define ETH_DMATBSCTRL3R_FTOS_Msk           (0xFFFFFFUL << ETH_DMATBSCTRL3R_FTOS_Pos)             /*!< 0xFFFFFF00 */
#define ETH_DMATBSCTRL3R_FTOS               ETH_DMATBSCTRL3R_FTOS_Msk                           /*!< Fetch time offset */

/**************  Bit definition for ETH_DMAC0CR register  **************/
#define ETH_DMAC0CR_MSS_Pos                 (0U)
#define ETH_DMAC0CR_MSS_Msk                 (0x3FFFUL << ETH_DMAC0CR_MSS_Pos)                    /*!< 0x00003FFF */
#define ETH_DMAC0CR_MSS                     ETH_DMAC0CR_MSS_Msk                                 /*!< Maximum Segment Size */
#define ETH_DMAC0CR_MSS_0                   (0x1UL << ETH_DMAC0CR_MSS_Pos)                       /*!< 0x00000001 */
#define ETH_DMAC0CR_MSS_1                   (0x2UL << ETH_DMAC0CR_MSS_Pos)                       /*!< 0x00000002 */
#define ETH_DMAC0CR_MSS_2                   (0x4UL << ETH_DMAC0CR_MSS_Pos)                       /*!< 0x00000004 */
#define ETH_DMAC0CR_MSS_3                   (0x8UL << ETH_DMAC0CR_MSS_Pos)                       /*!< 0x00000008 */
#define ETH_DMAC0CR_MSS_4                   (0x10UL << ETH_DMAC0CR_MSS_Pos)                      /*!< 0x00000010 */
#define ETH_DMAC0CR_MSS_5                   (0x20UL << ETH_DMAC0CR_MSS_Pos)                      /*!< 0x00000020 */
#define ETH_DMAC0CR_MSS_6                   (0x40UL << ETH_DMAC0CR_MSS_Pos)                      /*!< 0x00000040 */
#define ETH_DMAC0CR_MSS_7                   (0x80UL << ETH_DMAC0CR_MSS_Pos)                      /*!< 0x00000080 */
#define ETH_DMAC0CR_MSS_8                   (0x100UL << ETH_DMAC0CR_MSS_Pos)                     /*!< 0x00000100 */
#define ETH_DMAC0CR_MSS_9                   (0x200UL << ETH_DMAC0CR_MSS_Pos)                     /*!< 0x00000200 */
#define ETH_DMAC0CR_MSS_10                  (0x400UL << ETH_DMAC0CR_MSS_Pos)                     /*!< 0x00000400 */
#define ETH_DMAC0CR_MSS_11                  (0x800UL << ETH_DMAC0CR_MSS_Pos)                     /*!< 0x00000800 */
#define ETH_DMAC0CR_MSS_12                  (0x1000UL << ETH_DMAC0CR_MSS_Pos)                    /*!< 0x00001000 */
#define ETH_DMAC0CR_MSS_13                  (0x2000UL << ETH_DMAC0CR_MSS_Pos)                    /*!< 0x00002000 */
#define ETH_DMAC0CR_PBLX8_Pos               (16U)
#define ETH_DMAC0CR_PBLX8_Msk               (0x1UL << ETH_DMAC0CR_PBLX8_Pos)                     /*!< 0x00010000 */
#define ETH_DMAC0CR_PBLX8                   ETH_DMAC0CR_PBLX8_Msk                               /*!< 8xPBL mode */
#define ETH_DMAC0CR_DSL_Pos                 (18U)
#define ETH_DMAC0CR_DSL_Msk                 (0x7UL << ETH_DMAC0CR_DSL_Pos)                       /*!< 0x001C0000 */
#define ETH_DMAC0CR_DSL                     ETH_DMAC0CR_DSL_Msk                                 /*!< Descriptor Skip Length */
#define ETH_DMACCR_DSL_0BIT                 (0x0UL << ETH_DMAC0CR_DSL_Pos)                       /*!< 0x00000000 */
#define ETH_DMACCR_DSL_64BIT                (0x1UL << ETH_DMAC0CR_DSL_Pos)                       /*!< 0x00040000 */
#define ETH_DMACCR_DSL_128BIT               (0x2UL << ETH_DMAC0CR_DSL_Pos)                       /*!< 0x00080000 */
#define ETH_DMACCR_DSL_256BIT               (0x4UL << ETH_DMAC0CR_DSL_Pos)                       /*!< 0x00100000 */

/*************  Bit definition for ETH_DMAC0TXCR register  *************/
#define ETH_DMAC0TXCR_ST_Pos                (0U)
#define ETH_DMAC0TXCR_ST_Msk                (0x1UL << ETH_DMAC0TXCR_ST_Pos)                      /*!< 0x00000001 */
#define ETH_DMAC0TXCR_ST                    ETH_DMAC0TXCR_ST_Msk                                /*!< Start or Stop Transmission Command */
#define ETH_DMAC0TXCR_TCW_Pos               (1U)
#define ETH_DMAC0TXCR_TCW_Msk               (0x7UL << ETH_DMAC0TXCR_TCW_Pos)                     /*!< 0x0000000E */
#define ETH_DMAC0TXCR_TCW                   ETH_DMAC0TXCR_TCW_Msk                               /*!< Transmit Channel Weight */
#define ETH_DMAC0TXCR_TCW_0                 (0x1UL << ETH_DMAC0TXCR_TCW_Pos)                     /*!< 0x00000002 */
#define ETH_DMAC0TXCR_TCW_1                 (0x2UL << ETH_DMAC0TXCR_TCW_Pos)                     /*!< 0x00000004 */
#define ETH_DMAC0TXCR_TCW_2                 (0x4UL << ETH_DMAC0TXCR_TCW_Pos)                     /*!< 0x00000008 */
#define ETH_DMAC0TXCR_OSF_Pos               (4U)
#define ETH_DMAC0TXCR_OSF_Msk               (0x1UL << ETH_DMAC0TXCR_OSF_Pos)                     /*!< 0x00000010 */
#define ETH_DMAC0TXCR_OSF                   ETH_DMAC0TXCR_OSF_Msk                               /*!< Operate on Second Packet */
#define ETH_DMAC0TXCR_TSE_Pos               (12U)
#define ETH_DMAC0TXCR_TSE_Msk               (0x1UL << ETH_DMAC0TXCR_TSE_Pos)                     /*!< 0x00001000 */
#define ETH_DMAC0TXCR_TSE                   ETH_DMAC0TXCR_TSE_Msk                               /*!< TCP Segmentation Enabled */
#define ETH_DMAC0TXCR_IPBL_Pos              (15U)
#define ETH_DMAC0TXCR_IPBL_Msk              (0x1UL << ETH_DMAC0TXCR_IPBL_Pos)                   /*!< 0x00001000 */
#define ETH_DMAC0TXCR_IPBL                  ETH_DMAC0TXCR_IPBL_Msk                              /*!< TCP Segmentation Enabled */
#define ETH_DMAC0TXCR_TXPBL_Pos             (16U)
#define ETH_DMAC0TXCR_TXPBL_Msk             (0x3FUL << ETH_DMAC0TXCR_TXPBL_Pos)                  /*!< 0x003F0000 */
#define ETH_DMAC0TXCR_TXPBL                 ETH_DMAC0TXCR_TXPBL_Msk                             /*!< Transmit Programmable Burst Length */
#define ETH_DMAC0TXCR_TXPBL_1PBL            (0x1UL << ETH_DMAC0TXCR_TXPBL_Pos)                   /*!< 0x00010000 */
#define ETH_DMAC0TXCR_TXPBL_2PBL            (0x2UL << ETH_DMAC0TXCR_TXPBL_Pos)                   /*!< 0x00020000 */
#define ETH_DMAC0TXCR_TXPBL_4PBL            (0x4UL << ETH_DMAC0TXCR_TXPBL_Pos)                   /*!< 0x00040000 */
#define ETH_DMAC0TXCR_TXPBL_8PBL            (0x8UL << ETH_DMAC0TXCR_TXPBL_Pos)                   /*!< 0x00080000 */
#define ETH_DMAC0TXCR_TXPBL_16PBL           (0x10UL << ETH_DMAC0TXCR_TXPBL_Pos)                  /*!< 0x00100000 */
#define ETH_DMAC0TXCR_TXPBL_32PBL           (0x20UL << ETH_DMAC0TXCR_TXPBL_Pos)                  /*!< 0x00200000 */
#define ETH_DMAC0TXCR_TQOS_Pos              (24U)
#define ETH_DMAC0TXCR_TQOS_Msk              (0xFUL << ETH_DMAC0TXCR_TQOS_Pos)                    /*!< 0x0F000000 */
#define ETH_DMAC0TXCR_TQOS                  ETH_DMAC0TXCR_TQOS_Msk                              /*!< Transmit QOS. */
#define ETH_DMAC0TXCR_TQOS_0                (0x1UL << ETH_DMAC0TXCR_TQOS_Pos)                    /*!< 0x01000000 */
#define ETH_DMAC0TXCR_TQOS_1                (0x2UL << ETH_DMAC0TXCR_TQOS_Pos)                    /*!< 0x02000000 */
#define ETH_DMAC0TXCR_TQOS_2                (0x4UL << ETH_DMAC0TXCR_TQOS_Pos)                    /*!< 0x04000000 */
#define ETH_DMAC0TXCR_TQOS_3                (0x8UL << ETH_DMAC0TXCR_TQOS_Pos)                    /*!< 0x08000000 */
#define ETH_DMAC0TXCR_EDSE_Pos              (28U)
#define ETH_DMAC0TXCR_EDSE_Msk              (0x1UL << ETH_DMAC0TXCR_EDSE_Pos)                    /*!< 0x10000000 */
#define ETH_DMAC0TXCR_EDSE                  ETH_DMAC0TXCR_EDSE_Msk                              /*!< Enhanced Descriptor Enable */
#define ETH_DMAC0TXCR_TFSEL0_Pos            (29U)
#define ETH_DMAC0TXCR_TFSEL0_Msk            (0x1UL << ETH_DMAC0TXCR_TFSEL0_Pos)                  /*!< 0x20000000 */
#define ETH_DMAC0TXCR_TFSEL0                ETH_DMAC0TXCR_TFSEL0_Msk                            /*!< TBS Fetch Select */
#define ETH_DMAC0TXCR_TFSEL1_Pos            (30U)
#define ETH_DMAC0TXCR_TFSEL1_Msk            (0x1UL << ETH_DMAC0TXCR_TFSEL1_Pos)                  /*!< 0x40000000 */
#define ETH_DMAC0TXCR_TFSEL1                ETH_DMAC0TXCR_TFSEL1_Msk                            /*!< TBS Fetch Select */

/*************  Bit definition for ETH_DMAC0RXCR register  *************/
#define ETH_DMAC0RXCR_SR_Pos                (0U)
#define ETH_DMAC0RXCR_SR_Msk                (0x1UL << ETH_DMAC0RXCR_SR_Pos)                      /*!< 0x00000001 */
#define ETH_DMAC0RXCR_SR                    ETH_DMAC0RXCR_SR_Msk                                /*!< Start or Stop Receive */
#define ETH_DMAC0RXCR_RBSZ_Pos              (1U)
#define ETH_DMAC0RXCR_RBSZ_Msk              (0x3FFFUL << ETH_DMAC0RXCR_RBSZ_Pos)                 /*!< 0x00007FFE */
#define ETH_DMAC0RXCR_RBSZ                  ETH_DMAC0RXCR_RBSZ_Msk                              /*!< Receive Buffer size */
#define ETH_DMAC0RXCR_RBSZ_0                (0x1UL << ETH_DMAC0RXCR_RBSZ_Pos)                    /*!< 0x00000002 */
#define ETH_DMAC0RXCR_RBSZ_1                (0x2UL << ETH_DMAC0RXCR_RBSZ_Pos)                    /*!< 0x00000004 */
#define ETH_DMAC0RXCR_RBSZ_2                (0x4UL << ETH_DMAC0RXCR_RBSZ_Pos)                    /*!< 0x00000008 */
#define ETH_DMAC0RXCR_RBSZ_3                (0x8UL << ETH_DMAC0RXCR_RBSZ_Pos)                    /*!< 0x00000010 */
#define ETH_DMAC0RXCR_RBSZ_4                (0x10UL << ETH_DMAC0RXCR_RBSZ_Pos)                   /*!< 0x00000020 */
#define ETH_DMAC0RXCR_RBSZ_5                (0x20UL << ETH_DMAC0RXCR_RBSZ_Pos)                   /*!< 0x00000040 */
#define ETH_DMAC0RXCR_RBSZ_6                (0x40UL << ETH_DMAC0RXCR_RBSZ_Pos)                   /*!< 0x00000080 */
#define ETH_DMAC0RXCR_RBSZ_7                (0x80UL << ETH_DMAC0RXCR_RBSZ_Pos)                   /*!< 0x00000100 */
#define ETH_DMAC0RXCR_RBSZ_8                (0x100UL << ETH_DMAC0RXCR_RBSZ_Pos)                  /*!< 0x00000200 */
#define ETH_DMAC0RXCR_RBSZ_9                (0x200UL << ETH_DMAC0RXCR_RBSZ_Pos)                  /*!< 0x00000400 */
#define ETH_DMAC0RXCR_RBSZ_10               (0x400UL << ETH_DMAC0RXCR_RBSZ_Pos)                  /*!< 0x00000800 */
#define ETH_DMAC0RXCR_RBSZ_11               (0x800UL << ETH_DMAC0RXCR_RBSZ_Pos)                  /*!< 0x00001000 */
#define ETH_DMAC0RXCR_RBSZ_12               (0x1000UL << ETH_DMAC0RXCR_RBSZ_Pos)                 /*!< 0x00002000 */
#define ETH_DMAC0RXCR_RBSZ_13               (0x2000UL << ETH_DMAC0RXCR_RBSZ_Pos)                 /*!< 0x00004000 */
#define ETH_DMAC0RXCR_RXPBL_Pos             (16U)
#define ETH_DMAC0RXCR_RXPBL_Msk             (0x3FUL << ETH_DMAC0RXCR_RXPBL_Pos)                  /*!< 0x003F0000 */
#define ETH_DMAC0RXCR_RXPBL                 ETH_DMAC0RXCR_RXPBL_Msk                             /*!< Receive Programmable Burst Length */
#define ETH_DMAC0RXCR_RXPBL_1PBL            (0x1UL << ETH_DMAC0RXCR_RXPBL_Pos)                   /*!< 0x00010000 */
#define ETH_DMAC0RXCR_RXPBL_2PBL            (0x2UL << ETH_DMAC0RXCR_RXPBL_Pos)                   /*!< 0x00020000 */
#define ETH_DMAC0RXCR_RXPBL_4PBL            (0x4UL << ETH_DMAC0RXCR_RXPBL_Pos)                   /*!< 0x00040000 */
#define ETH_DMAC0RXCR_RXPBL_8PBL            (0x8UL << ETH_DMAC0RXCR_RXPBL_Pos)                   /*!< 0x00080000 */
#define ETH_DMAC0RXCR_RXPBL_16PBL           (0x10UL << ETH_DMAC0RXCR_RXPBL_Pos)                  /*!< 0x00100000 */
#define ETH_DMAC0RXCR_RXPBL_32PBL           (0x20UL << ETH_DMAC0RXCR_RXPBL_Pos)                  /*!< 0x00200000 */
#define ETH_DMAC0RXCR_RQOS_Pos              (24U)
#define ETH_DMAC0RXCR_RQOS_Msk              (0xFUL << ETH_DMAC0RXCR_RQOS_Pos)                    /*!< 0x0F000000 */
#define ETH_DMAC0RXCR_RQOS                  ETH_DMAC0RXCR_RQOS_Msk                              /*!< Rx AXI4 QOS. */
#define ETH_DMAC0RXCR_RQOS_0                (0x1UL << ETH_DMAC0RXCR_RQOS_Pos)                    /*!< 0x01000000 */
#define ETH_DMAC0RXCR_RQOS_1                (0x2UL << ETH_DMAC0RXCR_RQOS_Pos)                    /*!< 0x02000000 */
#define ETH_DMAC0RXCR_RQOS_2                (0x4UL << ETH_DMAC0RXCR_RQOS_Pos)                    /*!< 0x04000000 */
#define ETH_DMAC0RXCR_RQOS_3                (0x8UL << ETH_DMAC0RXCR_RQOS_Pos)                    /*!< 0x08000000 */
#define ETH_DMAC0RXCR_RPF_Pos               (31U)
#define ETH_DMAC0RXCR_RPF_Msk               (0x1UL << ETH_DMAC0RXCR_RPF_Pos)                     /*!< 0x80000000 */
#define ETH_DMAC0RXCR_RPF                   ETH_DMAC0RXCR_RPF_Msk                               /*!< DMA Rx Channel0 Packet Flush */

/************  Bit definition for ETH_DMAC0TXDLAR register  ************/
#define ETH_DMAC0TXDLAR_TDESLA_Pos          (3U)
#define ETH_DMAC0TXDLAR_TDESLA_Msk          (0x1FFFFFFFUL << ETH_DMAC0TXDLAR_TDESLA_Pos)         /*!< 0xFFFFFFF8 */
#define ETH_DMAC0TXDLAR_TDESLA              ETH_DMAC0TXDLAR_TDESLA_Msk                          /*!< Start of Transmit List */
#define ETH_DMAC0TXDLAR_TDESLA_0            (0x1UL << ETH_DMAC0TXDLAR_TDESLA_Pos)                /*!< 0x00000008 */
#define ETH_DMAC0TXDLAR_TDESLA_1            (0x2UL << ETH_DMAC0TXDLAR_TDESLA_Pos)                /*!< 0x00000010 */
#define ETH_DMAC0TXDLAR_TDESLA_2            (0x4UL << ETH_DMAC0TXDLAR_TDESLA_Pos)                /*!< 0x00000020 */
#define ETH_DMAC0TXDLAR_TDESLA_3            (0x8UL << ETH_DMAC0TXDLAR_TDESLA_Pos)                /*!< 0x00000040 */
#define ETH_DMAC0TXDLAR_TDESLA_4            (0x10UL << ETH_DMAC0TXDLAR_TDESLA_Pos)               /*!< 0x00000080 */
#define ETH_DMAC0TXDLAR_TDESLA_5            (0x20UL << ETH_DMAC0TXDLAR_TDESLA_Pos)               /*!< 0x00000100 */
#define ETH_DMAC0TXDLAR_TDESLA_6            (0x40UL << ETH_DMAC0TXDLAR_TDESLA_Pos)               /*!< 0x00000200 */
#define ETH_DMAC0TXDLAR_TDESLA_7            (0x80UL << ETH_DMAC0TXDLAR_TDESLA_Pos)               /*!< 0x00000400 */
#define ETH_DMAC0TXDLAR_TDESLA_8            (0x100UL << ETH_DMAC0TXDLAR_TDESLA_Pos)              /*!< 0x00000800 */
#define ETH_DMAC0TXDLAR_TDESLA_9            (0x200UL << ETH_DMAC0TXDLAR_TDESLA_Pos)              /*!< 0x00001000 */
#define ETH_DMAC0TXDLAR_TDESLA_10           (0x400UL << ETH_DMAC0TXDLAR_TDESLA_Pos)              /*!< 0x00002000 */
#define ETH_DMAC0TXDLAR_TDESLA_11           (0x800UL << ETH_DMAC0TXDLAR_TDESLA_Pos)              /*!< 0x00004000 */
#define ETH_DMAC0TXDLAR_TDESLA_12           (0x1000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)             /*!< 0x00008000 */
#define ETH_DMAC0TXDLAR_TDESLA_13           (0x2000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)             /*!< 0x00010000 */
#define ETH_DMAC0TXDLAR_TDESLA_14           (0x4000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)             /*!< 0x00020000 */
#define ETH_DMAC0TXDLAR_TDESLA_15           (0x8000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)             /*!< 0x00040000 */
#define ETH_DMAC0TXDLAR_TDESLA_16           (0x10000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)            /*!< 0x00080000 */
#define ETH_DMAC0TXDLAR_TDESLA_17           (0x20000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)            /*!< 0x00100000 */
#define ETH_DMAC0TXDLAR_TDESLA_18           (0x40000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)            /*!< 0x00200000 */
#define ETH_DMAC0TXDLAR_TDESLA_19           (0x80000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)            /*!< 0x00400000 */
#define ETH_DMAC0TXDLAR_TDESLA_20           (0x100000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)           /*!< 0x00800000 */
#define ETH_DMAC0TXDLAR_TDESLA_21           (0x200000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)           /*!< 0x01000000 */
#define ETH_DMAC0TXDLAR_TDESLA_22           (0x400000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)           /*!< 0x02000000 */
#define ETH_DMAC0TXDLAR_TDESLA_23           (0x800000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)           /*!< 0x04000000 */
#define ETH_DMAC0TXDLAR_TDESLA_24           (0x1000000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)          /*!< 0x08000000 */
#define ETH_DMAC0TXDLAR_TDESLA_25           (0x2000000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)          /*!< 0x10000000 */
#define ETH_DMAC0TXDLAR_TDESLA_26           (0x4000000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)          /*!< 0x20000000 */
#define ETH_DMAC0TXDLAR_TDESLA_27           (0x8000000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)          /*!< 0x40000000 */
#define ETH_DMAC0TXDLAR_TDESLA_28           (0x10000000UL << ETH_DMAC0TXDLAR_TDESLA_Pos)         /*!< 0x80000000 */

