STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253axx_cm33.h
/******************  Bit definition for EXTI1_PRIVCFGR3 register  ******************/
#define EXTI1_PRIVCFGR3_PRIV64_Pos  (0U)
#define EXTI1_PRIVCFGR3_PRIV64_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV64_Pos)          /*!< 0x00000001 */
#define EXTI1_PRIVCFGR3_PRIV64      EXTI1_PRIVCFGR3_PRIV64_Msk                    /*!< SEC/PRIV enable on event input 64 */
#define EXTI1_PRIVCFGR3_PRIV65_Pos  (1U)
#define EXTI1_PRIVCFGR3_PRIV65_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV65_Pos)          /*!< 0x00000002 */
#define EXTI1_PRIVCFGR3_PRIV65      EXTI1_PRIVCFGR3_PRIV65_Msk                    /*!< SEC/PRIV enable on event input 65 */
#define EXTI1_PRIVCFGR3_PRIV66_Pos  (2U)
#define EXTI1_PRIVCFGR3_PRIV66_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV66_Pos)          /*!< 0x00000004 */
#define EXTI1_PRIVCFGR3_PRIV66      EXTI1_PRIVCFGR3_PRIV66_Msk                    /*!< SEC/PRIV enable on event input 66 */
#define EXTI1_PRIVCFGR3_PRIV67_Pos  (3U)
#define EXTI1_PRIVCFGR3_PRIV67_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV67_Pos)          /*!< 0x00000008 */
#define EXTI1_PRIVCFGR3_PRIV67      EXTI1_PRIVCFGR3_PRIV67_Msk                    /*!< SEC/PRIV enable on event input 67 */
#define EXTI1_PRIVCFGR3_PRIV68_Pos  (4U)
#define EXTI1_PRIVCFGR3_PRIV68_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV68_Pos)          /*!< 0x00000010 */
#define EXTI1_PRIVCFGR3_PRIV68      EXTI1_PRIVCFGR3_PRIV68_Msk                    /*!< SEC/PRIV enable on event input 68 */
#define EXTI1_PRIVCFGR3_PRIV69_Pos  (5U)
#define EXTI1_PRIVCFGR3_PRIV69_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV69_Pos)          /*!< 0x00000020 */
#define EXTI1_PRIVCFGR3_PRIV69      EXTI1_PRIVCFGR3_PRIV69_Msk                    /*!< SEC/PRIV enable on event input 69 */
#define EXTI1_PRIVCFGR3_PRIV70_Pos  (6U)
#define EXTI1_PRIVCFGR3_PRIV70_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV70_Pos)          /*!< 0x00000040 */
#define EXTI1_PRIVCFGR3_PRIV70      EXTI1_PRIVCFGR3_PRIV70_Msk                    /*!< SEC/PRIV enable on event input 70 */
#define EXTI1_PRIVCFGR3_PRIV71_Pos  (7U)
#define EXTI1_PRIVCFGR3_PRIV71_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV71_Pos)          /*!< 0x00000080 */
#define EXTI1_PRIVCFGR3_PRIV71      EXTI1_PRIVCFGR3_PRIV71_Msk                    /*!< SEC/PRIV enable on event input 71 */
#define EXTI1_PRIVCFGR3_PRIV72_Pos  (8U)
#define EXTI1_PRIVCFGR3_PRIV72_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV72_Pos)          /*!< 0x00000100 */
#define EXTI1_PRIVCFGR3_PRIV72      EXTI1_PRIVCFGR3_PRIV72_Msk                    /*!< SEC/PRIV enable on event input 72 */
#define EXTI1_PRIVCFGR3_PRIV73_Pos  (9U)
#define EXTI1_PRIVCFGR3_PRIV73_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV73_Pos)          /*!< 0x00000200 */
#define EXTI1_PRIVCFGR3_PRIV73      EXTI1_PRIVCFGR3_PRIV73_Msk                    /*!< SEC/PRIV enable on event input 73 */
#define EXTI1_PRIVCFGR3_PRIV74_Pos  (10U)
#define EXTI1_PRIVCFGR3_PRIV74_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV74_Pos)           /*!< 0x00000400 */
#define EXTI1_PRIVCFGR3_PRIV74      EXTI1_PRIVCFGR3_PRIV74_Msk                     /*!< SEC/PRIV enable on event input 74 */
#define EXTI1_PRIVCFGR3_PRIV75_Pos  (11U)
#define EXTI1_PRIVCFGR3_PRIV75_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV75_Pos)           /*!< 0x00000800 */
#define EXTI1_PRIVCFGR3_PRIV75      EXTI1_PRIVCFGR3_PRIV75_Msk                     /*!< SEC/PRIV enable on event input 75 */
#define EXTI1_PRIVCFGR3_PRIV76_Pos  (12U)
#define EXTI1_PRIVCFGR3_PRIV76_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV76_Pos)           /*!< 0x00001000 */
#define EXTI1_PRIVCFGR3_PRIV76      EXTI1_PRIVCFGR3_PRIV76_Msk                     /*!< SEC/PRIV enable on event input 76 */
#define EXTI1_PRIVCFGR3_PRIV77_Pos  (13U)
#define EXTI1_PRIVCFGR3_PRIV77_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV77_Pos)           /*!< 0x00002000 */
#define EXTI1_PRIVCFGR3_PRIV77      EXTI1_PRIVCFGR3_PRIV77_Msk                     /*!< SEC/PRIV enable on event input 77 */
#define EXTI1_PRIVCFGR3_PRIV78_Pos  (14U)
#define EXTI1_PRIVCFGR3_PRIV78_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV78_Pos)           /*!< 0x00004000 */
#define EXTI1_PRIVCFGR3_PRIV78      EXTI1_PRIVCFGR3_PRIV78_Msk                     /*!< SEC/PRIV enable on event input 78 */
#define EXTI1_PRIVCFGR3_PRIV79_Pos  (15U)
#define EXTI1_PRIVCFGR3_PRIV79_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV79_Pos)           /*!< 0x00008000 */
#define EXTI1_PRIVCFGR3_PRIV79      EXTI1_PRIVCFGR3_PRIV79_Msk                     /*!< SEC/PRIV enable on event input 79 */
#define EXTI1_PRIVCFGR3_PRIV80_Pos  (16U)
#define EXTI1_PRIVCFGR3_PRIV80_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV80_Pos)           /*!< 0x00010000 */
#define EXTI1_PRIVCFGR3_PRIV80      EXTI1_PRIVCFGR3_PRIV80_Msk                     /*!< SEC/PRIV enable on event input 80 */
#define EXTI1_PRIVCFGR3_PRIV81_Pos  (17U)
#define EXTI1_PRIVCFGR3_PRIV81_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV81_Pos)           /*!< 0x00020000 */
#define EXTI1_PRIVCFGR3_PRIV81      EXTI1_PRIVCFGR3_PRIV81_Msk                     /*!< SEC/PRIV enable on event input 81 */
#define EXTI1_PRIVCFGR3_PRIV82_Pos  (18U)
#define EXTI1_PRIVCFGR3_PRIV82_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV82_Pos)           /*!< 0x00040000 */
#define EXTI1_PRIVCFGR3_PRIV82      EXTI1_PRIVCFGR3_PRIV82_Msk                     /*!< SEC/PRIV enable on event input 82 */
#define EXTI1_PRIVCFGR3_PRIV83_Pos  (19U)
#define EXTI1_PRIVCFGR3_PRIV83_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV83_Pos)           /*!< 0x00080000 */
#define EXTI1_PRIVCFGR3_PRIV83      EXTI1_PRIVCFGR3_PRIV83_Msk                     /*!< SEC/PRIV enable on event input 83 */
#define EXTI1_PRIVCFGR3_PRIV84_Pos  (20U)
#define EXTI1_PRIVCFGR3_PRIV84_Msk  (0x1UL << EXTI1_PRIVCFGR3_PRIV84_Pos)           /*!< 0x00200000 */
#define EXTI1_PRIVCFGR3_PRIV84      EXTI1_PRIVCFGR3_PRIV84_Msk                     /*!< SEC/PRIV enable on event input 84 */
/* no event input 84 - 95 */

/* Edu: common definition for EXTI1 EXTI2 */
/*****************  Bit definition for EXTI_EXTICR1, EXTICR[0] register  ***************/
#define EXTI_EXTICR1_EXTI0_Pos        (0U)
#define EXTI_EXTICR1_EXTI0_Msk        (0xFFUL << EXTI_EXTICR1_EXTI0_Pos)        /*!< 0x000000FF */
#define EXTI_EXTICR1_EXTI0            EXTI_EXTICR1_EXTI0_Msk                   /*!<EXTI 0 configuration */
#define EXTI_EXTICR1_EXTI1_Pos        (8U)
#define EXTI_EXTICR1_EXTI1_Msk        (0xFFUL << EXTI_EXTICR1_EXTI1_Pos)        /*!< 0x0000FF00 */
#define EXTI_EXTICR1_EXTI1            EXTI_EXTICR1_EXTI1_Msk                   /*!<EXTI 1 configuration */
#define EXTI_EXTICR1_EXTI2_Pos        (16U)
#define EXTI_EXTICR1_EXTI2_Msk        (0xFFUL << EXTI_EXTICR1_EXTI2_Pos)        /*!< 0x00FF0000 */
#define EXTI_EXTICR1_EXTI2            EXTI_EXTICR1_EXTI2_Msk                   /*!<EXTI 2 configuration */
#define EXTI_EXTICR1_EXTI3_Pos        (24U)
#define EXTI_EXTICR1_EXTI3_Msk        (0xFFUL << EXTI_EXTICR1_EXTI3_Pos)        /*!< 0xFF000000 */
#define EXTI_EXTICR1_EXTI3            EXTI_EXTICR1_EXTI3_Msk                   /*!<EXTI 3 configuration */
/**
  * @brief   EXTI0 configuration
  */
#define EXTI_EXTICR1_EXTI0_PA         ((0x00000000U)<<EXTI_EXTICR1_EXTI0_Pos)         /*!<PA[0] pin */
#define EXTI_EXTICR1_EXTI0_PB         ((0x00000001U)<<EXTI_EXTICR1_EXTI0_Pos)         /*!<PB[0] pin */
#define EXTI_EXTICR1_EXTI0_PC         ((0x00000002U)<<EXTI_EXTICR1_EXTI0_Pos)         /*!<PC[0] pin */
#define EXTI_EXTICR1_EXTI0_PD         ((0x00000003U)<<EXTI_EXTICR1_EXTI0_Pos)         /*!<PD[0] pin */
#define EXTI_EXTICR1_EXTI0_PE         ((0x00000004U)<<EXTI_EXTICR1_EXTI0_Pos)         /*!<PE[0] pin */
#define EXTI_EXTICR1_EXTI0_PF         ((0x00000005U)<<EXTI_EXTICR1_EXTI0_Pos)         /*!<PF[0] pin */
#define EXTI_EXTICR1_EXTI0_PG         ((0x00000006U)<<EXTI_EXTICR1_EXTI0_Pos)         /*!<PG[0] pin */
#define EXTI_EXTICR1_EXTI0_PH         ((0x00000007U)<<EXTI_EXTICR1_EXTI0_Pos)         /*!<PH[0] pin */
#define EXTI_EXTICR1_EXTI0_PI         ((0x00000008U)<<EXTI_EXTICR1_EXTI0_Pos)         /*!<PI[0] pin */
#define EXTI_EXTICR1_EXTI0_PJ         ((0x00000009U)<<EXTI_EXTICR1_EXTI0_Pos)         /*!<PJ[0] pin */
#define EXTI_EXTICR1_EXTI0_PK         ((0x0000000AU)<<EXTI_EXTICR1_EXTI0_Pos)         /*!<PK[0] pin */
#define EXTI_EXTICR1_EXTI0_PZ         ((0x0000000BU)<<EXTI_EXTICR1_EXTI0_Pos)         /*!<PZ[0] pin */

/**
  * @brief   EXTI1 configuration
  */
#define EXTI_EXTICR1_EXTI1_PA         ((0x00000000U)<<EXTI_EXTICR1_EXTI1_Pos)         /*!<PA[1] pin */
#define EXTI_EXTICR1_EXTI1_PB         ((0x00000001U)<<EXTI_EXTICR1_EXTI1_Pos)         /*!<PB[1] pin */
#define EXTI_EXTICR1_EXTI1_PC         ((0x00000002U)<<EXTI_EXTICR1_EXTI1_Pos)         /*!<PC[1] pin */
#define EXTI_EXTICR1_EXTI1_PD         ((0x00000003U)<<EXTI_EXTICR1_EXTI1_Pos)         /*!<PD[1] pin */
#define EXTI_EXTICR1_EXTI1_PE         ((0x00000004U)<<EXTI_EXTICR1_EXTI1_Pos)         /*!<PE[1] pin */
#define EXTI_EXTICR1_EXTI1_PF         ((0x00000005U)<<EXTI_EXTICR1_EXTI1_Pos)         /*!<PF[1] pin */
#define EXTI_EXTICR1_EXTI1_PG         ((0x00000006U)<<EXTI_EXTICR1_EXTI1_Pos)         /*!<PG[1] pin */
#define EXTI_EXTICR1_EXTI1_PH         ((0x00000007U)<<EXTI_EXTICR1_EXTI1_Pos)         /*!<PH[1] pin */
#define EXTI_EXTICR1_EXTI1_PI         ((0x00000008U)<<EXTI_EXTICR1_EXTI1_Pos)         /*!<PI[1] pin */
#define EXTI_EXTICR1_EXTI1_PJ         ((0x00000009U)<<EXTI_EXTICR1_EXTI1_Pos)         /*!<PJ[1] pin */
#define EXTI_EXTICR1_EXTI1_PK         ((0x0000000AU)<<EXTI_EXTICR1_EXTI1_Pos)         /*!<PK[1] pin */
#define EXTI_EXTICR1_EXTI1_PZ         ((0x0000000BU)<<EXTI_EXTICR1_EXTI1_Pos)         /*!<PZ[1] pin */


/**
  * @brief   EXTI2 configuration
  */
#define EXTI_EXTICR1_EXTI2_PA         ((0x00000000U)<<EXTI_EXTICR1_EXTI2_Pos)         /*!<PA[2] pin */
#define EXTI_EXTICR1_EXTI2_PB         ((0x00000001U)<<EXTI_EXTICR1_EXTI2_Pos)         /*!<PB[2] pin */
#define EXTI_EXTICR1_EXTI2_PC         ((0x00000002U)<<EXTI_EXTICR1_EXTI2_Pos)         /*!<PC[2] pin */
#define EXTI_EXTICR1_EXTI2_PD         ((0x00000003U)<<EXTI_EXTICR1_EXTI2_Pos)         /*!<PD[2] pin */
#define EXTI_EXTICR1_EXTI2_PE         ((0x00000004U)<<EXTI_EXTICR1_EXTI2_Pos)         /*!<PE[2] pin */
#define EXTI_EXTICR1_EXTI2_PF         ((0x00000005U)<<EXTI_EXTICR1_EXTI2_Pos)         /*!<PF[2] pin */
#define EXTI_EXTICR1_EXTI2_PG         ((0x00000006U)<<EXTI_EXTICR1_EXTI2_Pos)         /*!<PG[2] pin */
#define EXTI_EXTICR1_EXTI2_PH         ((0x00000007U)<<EXTI_EXTICR1_EXTI2_Pos)         /*!<PH[2] pin */
#define EXTI_EXTICR1_EXTI2_PI         ((0x00000008U)<<EXTI_EXTICR1_EXTI2_Pos)         /*!<PI[2] pin */
#define EXTI_EXTICR1_EXTI2_PJ         ((0x00000009U)<<EXTI_EXTICR1_EXTI2_Pos)         /*!<PJ[2] pin */
#define EXTI_EXTICR1_EXTI2_PK         ((0x0000000AU)<<EXTI_EXTICR1_EXTI2_Pos)         /*!<PK[2] pin */
#define EXTI_EXTICR1_EXTI2_PZ         ((0x0000000BU)<<EXTI_EXTICR1_EXTI2_Pos)         /*!<PZ[2] pin */

/**
  * @brief   EXTI3 configuration
  */
#define EXTI_EXTICR1_EXTI3_PA         ((0x00000000U)<<EXTI_EXTICR1_EXTI3_Pos)         /*!<PA[3] pin */
#define EXTI_EXTICR1_EXTI3_PB         ((0x00000001U)<<EXTI_EXTICR1_EXTI3_Pos)         /*!<PB[3] pin */
#define EXTI_EXTICR1_EXTI3_PC         ((0x00000002U)<<EXTI_EXTICR1_EXTI3_Pos)         /*!<PC[3] pin */
#define EXTI_EXTICR1_EXTI3_PD         ((0x00000003U)<<EXTI_EXTICR1_EXTI3_Pos)         /*!<PD[3] pin */
#define EXTI_EXTICR1_EXTI3_PE         ((0x00000004U)<<EXTI_EXTICR1_EXTI3_Pos)         /*!<PE[3] pin */
#define EXTI_EXTICR1_EXTI3_PF         ((0x00000005U)<<EXTI_EXTICR1_EXTI3_Pos)         /*!<PF[3] pin */
#define EXTI_EXTICR1_EXTI3_PG         ((0x00000006U)<<EXTI_EXTICR1_EXTI3_Pos)         /*!<PG[3] pin */
#define EXTI_EXTICR1_EXTI3_PH         ((0x00000007U)<<EXTI_EXTICR1_EXTI3_Pos)         /*!<PH[3] pin */
#define EXTI_EXTICR1_EXTI3_PI         ((0x00000008U)<<EXTI_EXTICR1_EXTI3_Pos)         /*!<PI[3] pin */
#define EXTI_EXTICR1_EXTI3_PJ         ((0x00000009U)<<EXTI_EXTICR1_EXTI3_Pos)         /*!<PJ[3] pin */
#define EXTI_EXTICR1_EXTI3_PK         ((0x0000000AU)<<EXTI_EXTICR1_EXTI3_Pos)         /*!<PK[3] pin */
#define EXTI_EXTICR1_EXTI3_PZ         ((0x0000000BU)<<EXTI_EXTICR1_EXTI3_Pos)         /*!<PZ[3] pin */

/*****************  Bit definition for EXTI_EXTICR2 register  ***************/
#define EXTI_EXTICR2_EXTI4_Pos        (0U)
#define EXTI_EXTICR2_EXTI4_Msk        (0xFFUL << EXTI_EXTICR2_EXTI4_Pos)        /*!< 0x000000FF */
#define EXTI_EXTICR2_EXTI4            EXTI_EXTICR2_EXTI4_Msk                   /*!<EXTI 4 configuration */
#define EXTI_EXTICR2_EXTI5_Pos        (8U)
#define EXTI_EXTICR2_EXTI5_Msk        (0xFFUL << EXTI_EXTICR2_EXTI5_Pos)        /*!< 0x0000FF00 */
#define EXTI_EXTICR2_EXTI5            EXTI_EXTICR2_EXTI5_Msk                   /*!<EXTI 5 configuration */
#define EXTI_EXTICR2_EXTI6_Pos        (16U)
#define EXTI_EXTICR2_EXTI6_Msk        (0xFFUL << EXTI_EXTICR2_EXTI6_Pos)        /*!< 0x00FF0000 */
#define EXTI_EXTICR2_EXTI6            EXTI_EXTICR2_EXTI6_Msk                   /*!<EXTI 6 configuration */
#define EXTI_EXTICR2_EXTI7_Pos        (24U)
#define EXTI_EXTICR2_EXTI7_Msk        (0xFFUL << EXTI_EXTICR2_EXTI7_Pos)        /*!< 0xFF000000 */
#define EXTI_EXTICR2_EXTI7            EXTI_EXTICR2_EXTI7_Msk                   /*!<EXTI 7 configuration */

/**
  * @brief   EXTI4 configuration
  */
#define EXTI_EXTICR2_EXTI4_PA         ((0x00000000U)<<EXTI_EXTICR2_EXTI4_Pos)                   /*!<PA[4] pin */
#define EXTI_EXTICR2_EXTI4_PB         ((0x00000001U)<<EXTI_EXTICR2_EXTI4_Pos)                   /*!<PB[4] pin */
#define EXTI_EXTICR2_EXTI4_PC         ((0x00000002U)<<EXTI_EXTICR2_EXTI4_Pos)                   /*!<PC[4] pin */
#define EXTI_EXTICR2_EXTI4_PD         ((0x00000003U)<<EXTI_EXTICR2_EXTI4_Pos)                   /*!<PD[4] pin */
#define EXTI_EXTICR2_EXTI4_PE         ((0x00000004U)<<EXTI_EXTICR2_EXTI4_Pos)                   /*!<PE[4] pin */
#define EXTI_EXTICR2_EXTI4_PF         ((0x00000005U)<<EXTI_EXTICR2_EXTI4_Pos)                   /*!<PF[4] pin */
#define EXTI_EXTICR2_EXTI4_PG         ((0x00000006U)<<EXTI_EXTICR2_EXTI4_Pos)                   /*!<PG[4] pin */
#define EXTI_EXTICR2_EXTI4_PH         ((0x00000007U)<<EXTI_EXTICR2_EXTI4_Pos)                   /*!<PH[4] pin */
#define EXTI_EXTICR2_EXTI4_PI         ((0x00000008U)<<EXTI_EXTICR2_EXTI4_Pos)                   /*!<PI[4] pin */
#define EXTI_EXTICR2_EXTI4_PJ         ((0x00000009U)<<EXTI_EXTICR2_EXTI4_Pos)                   /*!<PJ[4] pin */
#define EXTI_EXTICR2_EXTI4_PK         ((0x0000000AU)<<EXTI_EXTICR2_EXTI4_Pos)                   /*!<PK[4] pin */
#define EXTI_EXTICR2_EXTI4_PZ         ((0x0000000BU)<<EXTI_EXTICR2_EXTI4_Pos)                   /*!<PZ[4] pin */

/**
  * @brief   EXTI5 configuration
  */
#define EXTI_EXTICR2_EXTI5_PA         ((0x00000000U)<<EXTI_EXTICR2_EXTI5_Pos)         /*!<PA[5] pin */
#define EXTI_EXTICR2_EXTI5_PB         ((0x00000001U)<<EXTI_EXTICR2_EXTI5_Pos)         /*!<PB[5] pin */
#define EXTI_EXTICR2_EXTI5_PC         ((0x00000002U)<<EXTI_EXTICR2_EXTI5_Pos)         /*!<PC[5] pin */
#define EXTI_EXTICR2_EXTI5_PD         ((0x00000003U)<<EXTI_EXTICR2_EXTI5_Pos)         /*!<PD[5] pin */
#define EXTI_EXTICR2_EXTI5_PE         ((0x00000004U)<<EXTI_EXTICR2_EXTI5_Pos)         /*!<PE[5] pin */
#define EXTI_EXTICR2_EXTI5_PF         ((0x00000005U)<<EXTI_EXTICR2_EXTI5_Pos)         /*!<PF[5] pin */
#define EXTI_EXTICR2_EXTI5_PG         ((0x00000006U)<<EXTI_EXTICR2_EXTI5_Pos)         /*!<PG[5] pin */
#define EXTI_EXTICR2_EXTI5_PH         ((0x00000007U)<<EXTI_EXTICR2_EXTI5_Pos)         /*!<PH[5] pin */
#define EXTI_EXTICR2_EXTI5_PI         ((0x00000008U)<<EXTI_EXTICR2_EXTI5_Pos)         /*!<PI[5] pin */
#define EXTI_EXTICR2_EXTI5_PJ         ((0x00000009U)<<EXTI_EXTICR2_EXTI5_Pos)         /*!<PJ[5] pin */
#define EXTI_EXTICR2_EXTI5_PK         ((0x0000000AU)<<EXTI_EXTICR2_EXTI5_Pos)         /*!<PK[5] pin */
#define EXTI_EXTICR2_EXTI5_PZ         ((0x0000000BU)<<EXTI_EXTICR2_EXTI5_Pos)         /*!<PZ[5] pin */

/**
  * @brief   EXTI6 configuration
  */
#define EXTI_EXTICR2_EXTI6_PA         ((0x00000000U)<<EXTI_EXTICR2_EXTI6_Pos)         /*!<PA[6] pin */
#define EXTI_EXTICR2_EXTI6_PB         ((0x00000001U)<<EXTI_EXTICR2_EXTI6_Pos)         /*!<PB[6] pin */
#define EXTI_EXTICR2_EXTI6_PC         ((0x00000002U)<<EXTI_EXTICR2_EXTI6_Pos)         /*!<PC[6] pin */
#define EXTI_EXTICR2_EXTI6_PD         ((0x00000003U)<<EXTI_EXTICR2_EXTI6_Pos)         /*!<PD[6] pin */
#define EXTI_EXTICR2_EXTI6_PE         ((0x00000004U)<<EXTI_EXTICR2_EXTI6_Pos)         /*!<PE[6] pin */
#define EXTI_EXTICR2_EXTI6_PF         ((0x00000005U)<<EXTI_EXTICR2_EXTI6_Pos)         /*!<PF[6] pin */
#define EXTI_EXTICR2_EXTI6_PG         ((0x00000006U)<<EXTI_EXTICR2_EXTI6_Pos)         /*!<PG[6] pin */
#define EXTI_EXTICR2_EXTI6_PH         ((0x00000007U)<<EXTI_EXTICR2_EXTI6_Pos)         /*!<PH[6] pin */
#define EXTI_EXTICR2_EXTI6_PI         ((0x00000008U)<<EXTI_EXTICR2_EXTI6_Pos)         /*!<PI[6] pin */
#define EXTI_EXTICR2_EXTI6_PJ         ((0x00000009U)<<EXTI_EXTICR2_EXTI6_Pos)         /*!<PJ[6] pin */
#define EXTI_EXTICR2_EXTI6_PK         ((0x0000000AU)<<EXTI_EXTICR2_EXTI6_Pos)         /*!<PK[6] pin */
#define EXTI_EXTICR2_EXTI6_PZ         ((0x0000000BU)<<EXTI_EXTICR2_EXTI6_Pos)         /*!<PZ[6] pin */

/**
  * @brief   EXTI7 configuration
  */
#define EXTI_EXTICR2_EXTI7_PA         ((0x00000000U)<<EXTI_EXTICR2_EXTI7_Pos)         /*!<PA[7] pin */
#define EXTI_EXTICR2_EXTI7_PB         ((0x00000001U)<<EXTI_EXTICR2_EXTI7_Pos)         /*!<PB[7] pin */
#define EXTI_EXTICR2_EXTI7_PC         ((0x00000002U)<<EXTI_EXTICR2_EXTI7_Pos)         /*!<PC[7] pin */
#define EXTI_EXTICR2_EXTI7_PD         ((0x00000003U)<<EXTI_EXTICR2_EXTI7_Pos)         /*!<PD[7] pin */
#define EXTI_EXTICR2_EXTI7_PE         ((0x00000004U)<<EXTI_EXTICR2_EXTI7_Pos)         /*!<PE[7] pin */
#define EXTI_EXTICR2_EXTI7_PF         ((0x00000005U)<<EXTI_EXTICR2_EXTI7_Pos)         /*!<PF[7] pin */
#define EXTI_EXTICR2_EXTI7_PG         ((0x00000006U)<<EXTI_EXTICR2_EXTI7_Pos)         /*!<PG[7] pin */
#define EXTI_EXTICR2_EXTI7_PH         ((0x00000007U)<<EXTI_EXTICR2_EXTI7_Pos)         /*!<PH[7] pin */
#define EXTI_EXTICR2_EXTI7_PI         ((0x00000008U)<<EXTI_EXTICR2_EXTI7_Pos)         /*!<PI[7] pin */
#define EXTI_EXTICR2_EXTI7_PJ         ((0x00000009U)<<EXTI_EXTICR2_EXTI7_Pos)         /*!<PJ[7] pin */
#define EXTI_EXTICR2_EXTI7_PK         ((0x0000000AU)<<EXTI_EXTICR2_EXTI7_Pos)         /*!<PK[7] pin */
#define EXTI_EXTICR2_EXTI7_PZ         ((0x0000000BU)<<EXTI_EXTICR2_EXTI7_Pos)         /*!<PZ[7] pin */

