STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253axx_cm33.h
/****************  Bit definition for HSEM_G1CIDCFGR register  ****************/
#define HSEM_G1CIDCFGR_CFEN_Pos         (0U)
#define HSEM_G1CIDCFGR_CFEN_Msk         (0x1UL << HSEM_G1CIDCFGR_CFEN_Pos)         /*!< 0x00000001 */
#define HSEM_G1CIDCFGR_CFEN             HSEM_G1CIDCFGR_CFEN_Msk                   /*!< Semaphore group p global CID filtering enable. */
#define HSEM_G1CIDCFGR_SEM_WLIST_C_Pos  (16U)
#define HSEM_G1CIDCFGR_SEM_WLIST_C_Msk  (0x7UL << HSEM_G1CIDCFGR_SEM_WLIST_C_Pos)  /*!< 0x00070000 */
#define HSEM_G1CIDCFGR_SEM_WLIST_C      HSEM_G1CIDCFGR_SEM_WLIST_C_Msk            /*!< Semaphore group p CID filtering enable. */

/****************  Bit definition for HSEM_G2CIDCFGR register  ****************/
#define HSEM_G2CIDCFGR_CFEN_Pos         (0U)
#define HSEM_G2CIDCFGR_CFEN_Msk         (0x1UL << HSEM_G2CIDCFGR_CFEN_Pos)         /*!< 0x00000001 */
#define HSEM_G2CIDCFGR_CFEN             HSEM_G2CIDCFGR_CFEN_Msk                   /*!< Semaphore group p global CID filtering enable. */
#define HSEM_G2CIDCFGR_SEM_WLIST_C_Pos  (16U)
#define HSEM_G2CIDCFGR_SEM_WLIST_C_Msk  (0x7UL << HSEM_G2CIDCFGR_SEM_WLIST_C_Pos)  /*!< 0x00070000 */
#define HSEM_G2CIDCFGR_SEM_WLIST_C      HSEM_G2CIDCFGR_SEM_WLIST_C_Msk            /*!< Semaphore group p CID filtering enable. */

/****************  Bit definition for HSEM_G3CIDCFGR register  ****************/
#define HSEM_G3CIDCFGR_CFEN_Pos         (0U)
#define HSEM_G3CIDCFGR_CFEN_Msk         (0x1UL << HSEM_G3CIDCFGR_CFEN_Pos)         /*!< 0x00000001 */
#define HSEM_G3CIDCFGR_CFEN             HSEM_G3CIDCFGR_CFEN_Msk                   /*!< Semaphore group p global CID filtering enable. */
#define HSEM_G3CIDCFGR_SEM_WLIST_C_Pos  (16U)
#define HSEM_G3CIDCFGR_SEM_WLIST_C_Msk  (0x7UL << HSEM_G3CIDCFGR_SEM_WLIST_C_Pos)  /*!< 0x00070000 */
#define HSEM_G3CIDCFGR_SEM_WLIST_C      HSEM_G3CIDCFGR_SEM_WLIST_C_Msk            /*!< Semaphore group p CID filtering enable. */

/*****************  Bit definition for HSEM_HWCFGR2 register  *****************/
#define HSEM_HWCFGR2_MASTERID1_Pos      (0U)
#define HSEM_HWCFGR2_MASTERID1_Msk      (0xFUL << HSEM_HWCFGR2_MASTERID1_Pos)      /*!< 0x0000000F */
#define HSEM_HWCFGR2_MASTERID1          HSEM_HWCFGR2_MASTERID1_Msk                /*!< Hardware configuration valid bus masters ID1 */
#define HSEM_HWCFGR2_MASTERID2_Pos      (4U)
#define HSEM_HWCFGR2_MASTERID2_Msk      (0xFUL << HSEM_HWCFGR2_MASTERID2_Pos)      /*!< 0x000000F0 */
#define HSEM_HWCFGR2_MASTERID2          HSEM_HWCFGR2_MASTERID2_Msk                /*!< Hardware configuration valid bus masters ID2 */
#define HSEM_HWCFGR2_MASTERID3_Pos      (8U)
#define HSEM_HWCFGR2_MASTERID3_Msk      (0xFUL << HSEM_HWCFGR2_MASTERID3_Pos)      /*!< 0x00000F00 */
#define HSEM_HWCFGR2_MASTERID3          HSEM_HWCFGR2_MASTERID3_Msk                /*!< Hardware configuration valid bus masters ID3 */
#define HSEM_HWCFGR2_MASTERID4_Pos      (12U)
#define HSEM_HWCFGR2_MASTERID4_Msk      (0xFUL << HSEM_HWCFGR2_MASTERID4_Pos)      /*!< 0x0000F000 */
#define HSEM_HWCFGR2_MASTERID4          HSEM_HWCFGR2_MASTERID4_Msk                /*!< Hardware configuration valid bus masters ID4 */

/*****************  Bit definition for HSEM_HWCFGR1 register  *****************/
#define HSEM_HWCFGR1_NBSEM_Pos          (0U)
#define HSEM_HWCFGR1_NBSEM_Msk          (0xFFUL << HSEM_HWCFGR1_NBSEM_Pos)         /*!< 0x000000FF */
#define HSEM_HWCFGR1_NBSEM              HSEM_HWCFGR1_NBSEM_Msk                    /*!< Hardware configuration number of semaphores */
#define HSEM_HWCFGR1_NBINT_Pos          (8U)
#define HSEM_HWCFGR1_NBINT_Msk          (0xFUL << HSEM_HWCFGR1_NBINT_Pos)          /*!< 0x00000F00 */
#define HSEM_HWCFGR1_NBINT              HSEM_HWCFGR1_NBINT_Msk                    /*!< Hardware configuration number of interrupts/supported number of master ID */
#define HSEM_HWCFGR1_CID_WIDTH_Pos      (12U)
#define HSEM_HWCFGR1_CID_WIDTH_Msk      (0xFUL << HSEM_HWCFGR1_CID_WIDTH_Pos)      /*!< 0x0000F000 */
#define HSEM_HWCFGR1_CID_WIDTH          HSEM_HWCFGR1_CID_WIDTH_Msk                /*!< Hardware Configuration compartment isolation bus width */
#define HSEM_HWCFGR1_SECEN_Pos          (16U)
#define HSEM_HWCFGR1_SECEN_Msk          (0x1UL << HSEM_HWCFGR1_SECEN_Pos)          /*!< 0x00010000 */
#define HSEM_HWCFGR1_SECEN              HSEM_HWCFGR1_SECEN_Msk                    /*!< Hardware Configuration security protection enable */
#define HSEM_HWCFGR1_PRIVEN_Pos         (17U)
#define HSEM_HWCFGR1_PRIVEN_Msk         (0x1UL << HSEM_HWCFGR1_PRIVEN_Pos)         /*!< 0x00020000 */
#define HSEM_HWCFGR1_PRIVEN             HSEM_HWCFGR1_PRIVEN_Msk                   /*!< Hardware Configuration privilege protection enable */
#define HSEM_HWCFGR1_CFEN_Pos           (18U)
#define HSEM_HWCFGR1_CFEN_Msk           (0x1UL << HSEM_HWCFGR1_CFEN_Pos)           /*!< 0x00040000 */
#define HSEM_HWCFGR1_CFEN               HSEM_HWCFGR1_CFEN_Msk                     /*!< Hardware Configuration compartment filtering enable */

/******************  Bit definition for HSEM_VERR register  *******************/
#define HSEM_VERR_MINREV_Pos            (0U)
#define HSEM_VERR_MINREV_Msk            (0xFUL << HSEM_VERR_MINREV_Pos)            /*!< 0x0000000F */
#define HSEM_VERR_MINREV                HSEM_VERR_MINREV_Msk                      /*!< IP minor revision number */
#define HSEM_VERR_MAJREV_Pos            (4U)
#define HSEM_VERR_MAJREV_Msk            (0xFUL << HSEM_VERR_MAJREV_Pos)            /*!< 0x000000F0 */
#define HSEM_VERR_MAJREV                HSEM_VERR_MAJREV_Msk                      /*!< IP major revision number */

/******************  Bit definition for HSEM_IPIDR register  ******************/
#define HSEM_IPIDR_IPID_Pos             (0U)
#define HSEM_IPIDR_IPID_Msk             (0xFFFFFFFFUL << HSEM_IPIDR_IPID_Pos)      /*!< 0xFFFFFFFF */
#define HSEM_IPIDR_IPID                 HSEM_IPIDR_IPID_Msk                       /*!< IP identification */

/******************  Bit definition for HSEM_SIDR register  *******************/
#define HSEM_SIDR_SID_Pos               (0U)
#define HSEM_SIDR_SID_Msk               (0xFFFFFFFFUL << HSEM_SIDR_SID_Pos)        /*!< 0xFFFFFFFF */
#define HSEM_SIDR_SID                   HSEM_SIDR_SID_Msk                         /*!< IP size identification */

/******************************************************************************/
/*                                                                            */
/*                            ICACHE unit (ICACHE)                            */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for ICACHE_CR register  *******************/
#define ICACHE_CR_EN_Pos             (0U)
#define ICACHE_CR_EN_Msk             (0x1UL << ICACHE_CR_EN_Pos)               /*!< 0x00000001 */
#define ICACHE_CR_EN                 ICACHE_CR_EN_Msk                         /*!< enable */
#define ICACHE_CR_CACHEINV_Pos       (1U)
#define ICACHE_CR_CACHEINV_Msk       (0x1UL << ICACHE_CR_CACHEINV_Pos)         /*!< 0x00000002 */
#define ICACHE_CR_CACHEINV           ICACHE_CR_CACHEINV_Msk                   /*!< cache invalidation */
#define ICACHE_CR_WAYSEL_Pos         (2U)
#define ICACHE_CR_WAYSEL_Msk         (0x1UL << ICACHE_CR_WAYSEL_Pos)           /*!< 0x00000004 */
#define ICACHE_CR_WAYSEL             ICACHE_CR_WAYSEL_Msk                     /*!< cache associativity mode selection */
#define ICACHE_CR_HITMEN_Pos         (16U)
#define ICACHE_CR_HITMEN_Msk         (0x1UL << ICACHE_CR_HITMEN_Pos)           /*!< 0x00010000 */
#define ICACHE_CR_HITMEN             ICACHE_CR_HITMEN_Msk                     /*!< hit monitor enable */
#define ICACHE_CR_MISSMEN_Pos        (17U)
#define ICACHE_CR_MISSMEN_Msk        (0x1UL << ICACHE_CR_MISSMEN_Pos)          /*!< 0x00020000 */
#define ICACHE_CR_MISSMEN            ICACHE_CR_MISSMEN_Msk                    /*!< miss monitor enable */
#define ICACHE_CR_HITMRST_Pos        (18U)
#define ICACHE_CR_HITMRST_Msk        (0x1UL << ICACHE_CR_HITMRST_Pos)          /*!< 0x00040000 */
#define ICACHE_CR_HITMRST            ICACHE_CR_HITMRST_Msk                    /*!< hit monitor reset */
#define ICACHE_CR_MISSMRST_Pos       (19U)
#define ICACHE_CR_MISSMRST_Msk       (0x1UL << ICACHE_CR_MISSMRST_Pos)         /*!< 0x00080000 */
#define ICACHE_CR_MISSMRST           ICACHE_CR_MISSMRST_Msk                   /*!< miss monitor reset */

/******************  Bit definition for ICACHE_SR register  *******************/
#define ICACHE_SR_BUSYF_Pos          (0U)
#define ICACHE_SR_BUSYF_Msk          (0x1UL << ICACHE_SR_BUSYF_Pos)            /*!< 0x00000001 */
#define ICACHE_SR_BUSYF              ICACHE_SR_BUSYF_Msk                      /*!< busy flag */
#define ICACHE_SR_BSYENDF_Pos        (1U)
#define ICACHE_SR_BSYENDF_Msk        (0x1UL << ICACHE_SR_BSYENDF_Pos)          /*!< 0x00000002 */
#define ICACHE_SR_BSYENDF            ICACHE_SR_BSYENDF_Msk                    /*!< busy end flag */
#define ICACHE_SR_ERRF_Pos           (2U)
#define ICACHE_SR_ERRF_Msk           (0x1UL << ICACHE_SR_ERRF_Pos)             /*!< 0x00000004 */
#define ICACHE_SR_ERRF               ICACHE_SR_ERRF_Msk                       /*!< cache error flag */

