STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253axx_cm33.h
/* Bit fields for RCC_IWDGC1CFGSETR register */
#define RCC_IWDGC1CFGSETR_IWDG1_SYSRSTEN_Pos         (0U)
#define RCC_IWDGC1CFGSETR_IWDG1_SYSRSTEN_Msk         (0x1UL << RCC_IWDGC1CFGSETR_IWDG1_SYSRSTEN_Pos)        /*!< 0x00000001 */
#define RCC_IWDGC1CFGSETR_IWDG1_SYSRSTEN             RCC_IWDGC1CFGSETR_IWDG1_SYSRSTEN_Msk                  /*!< Enable of IWDG1 timeout event to reset the application */
#define RCC_IWDGC1CFGSETR_IWDG2_SYSRSTEN_Pos         (2U)
#define RCC_IWDGC1CFGSETR_IWDG2_SYSRSTEN_Msk         (0x1UL << RCC_IWDGC1CFGSETR_IWDG2_SYSRSTEN_Pos)        /*!< 0x00000004 */
#define RCC_IWDGC1CFGSETR_IWDG2_SYSRSTEN             RCC_IWDGC1CFGSETR_IWDG2_SYSRSTEN_Msk                  /*!< Enable of IWDG2 timeout event to reset the application */
#define RCC_IWDGC1CFGSETR_IWDG2_KERRST_Pos           (18U)
#define RCC_IWDGC1CFGSETR_IWDG2_KERRST_Msk           (0x1UL << RCC_IWDGC1CFGSETR_IWDG2_KERRST_Pos)          /*!< 0x00040000 */
#define RCC_IWDGC1CFGSETR_IWDG2_KERRST               RCC_IWDGC1CFGSETR_IWDG2_KERRST_Msk                    /*!< IWDG2 kernel reset */

/* Bit fields for RCC_IWDGC1CFGCLRR register */
#define RCC_IWDGC1CFGCLRR_IWDG1_SYSRSTEN_Pos         (0U)
#define RCC_IWDGC1CFGCLRR_IWDG1_SYSRSTEN_Msk         (0x1UL << RCC_IWDGC1CFGCLRR_IWDG1_SYSRSTEN_Pos)        /*!< 0x00000001 */
#define RCC_IWDGC1CFGCLRR_IWDG1_SYSRSTEN             RCC_IWDGC1CFGCLRR_IWDG1_SYSRSTEN_Msk                  /*!< Clear of IWDG1 timeout event to reset the application */
#define RCC_IWDGC1CFGCLRR_IWDG2_SYSRSTEN_Pos         (2U)
#define RCC_IWDGC1CFGCLRR_IWDG2_SYSRSTEN_Msk         (0x1UL << RCC_IWDGC1CFGCLRR_IWDG2_SYSRSTEN_Pos)        /*!< 0x00000004 */
#define RCC_IWDGC1CFGCLRR_IWDG2_SYSRSTEN             RCC_IWDGC1CFGCLRR_IWDG2_SYSRSTEN_Msk                  /*!< Clear of IWDG2 timeout event to reset the application */
#define RCC_IWDGC1CFGCLRR_IWDG2_KERRST_Pos           (18U)
#define RCC_IWDGC1CFGCLRR_IWDG2_KERRST_Msk           (0x1UL << RCC_IWDGC1CFGCLRR_IWDG2_KERRST_Pos)          /*!< 0x00040000 */
#define RCC_IWDGC1CFGCLRR_IWDG2_KERRST               RCC_IWDGC1CFGCLRR_IWDG2_KERRST_Msk                    /*!< IWDG2 kernel reset */

/* Bit fields for RCC_IWDGC2FZSETR register */
#define RCC_IWDGC2FZSETR_FZ_IWDG3_Pos                (0U)
#define RCC_IWDGC2FZSETR_FZ_IWDG3_Msk                (0x1UL << RCC_IWDGC2FZSETR_FZ_IWDG3_Pos)               /*!< 0x00000001 */
#define RCC_IWDGC2FZSETR_FZ_IWDG3                    RCC_IWDGC2FZSETR_FZ_IWDG3_Msk                         /*!< Freeze of IWDG3 clock */
#define RCC_IWDGC2FZSETR_FZ_IWDG4_Pos                (1U)
#define RCC_IWDGC2FZSETR_FZ_IWDG4_Msk                (0x1UL << RCC_IWDGC2FZSETR_FZ_IWDG4_Pos)               /*!< 0x00000002 */
#define RCC_IWDGC2FZSETR_FZ_IWDG4                    RCC_IWDGC2FZSETR_FZ_IWDG4_Msk                         /*!< Freeze of IWDG4 clock */

/* Bit fields for RCC_IWDGC2FZCLRR register */
#define RCC_IWDGC2FZCLRR_FZ_IWDG3_Pos                (0U)
#define RCC_IWDGC2FZCLRR_FZ_IWDG3_Msk                (0x1UL << RCC_IWDGC2FZCLRR_FZ_IWDG3_Pos)               /*!< 0x00000001 */
#define RCC_IWDGC2FZCLRR_FZ_IWDG3                    RCC_IWDGC2FZCLRR_FZ_IWDG3_Msk                         /*!< Unfreeze of IWDG3 clock */
#define RCC_IWDGC2FZCLRR_FZ_IWDG4_Pos                (1U)
#define RCC_IWDGC2FZCLRR_FZ_IWDG4_Msk                (0x1UL << RCC_IWDGC2FZCLRR_FZ_IWDG4_Pos)               /*!< 0x00000002 */
#define RCC_IWDGC2FZCLRR_FZ_IWDG4                    RCC_IWDGC2FZCLRR_FZ_IWDG4_Msk                         /*!< Unfreeze of IWDG4 clock */

/* Bit fields for RCC_IWDGC2CFGSETR register */
#define RCC_IWDGC2CFGSETR_IWDG3_SYSRSTEN_Pos         (0U)
#define RCC_IWDGC2CFGSETR_IWDG3_SYSRSTEN_Msk         (0x1UL << RCC_IWDGC2CFGSETR_IWDG3_SYSRSTEN_Pos)        /*!< 0x00000001 */
#define RCC_IWDGC2CFGSETR_IWDG3_SYSRSTEN             RCC_IWDGC2CFGSETR_IWDG3_SYSRSTEN_Msk                  /*!< Enable of IWDG3 timeout event to reset the application */
#define RCC_IWDGC2CFGSETR_IWDG4_SYSRSTEN_Pos         (2U)
#define RCC_IWDGC2CFGSETR_IWDG4_SYSRSTEN_Msk         (0x1UL << RCC_IWDGC2CFGSETR_IWDG4_SYSRSTEN_Pos)        /*!< 0x00000004 */
#define RCC_IWDGC2CFGSETR_IWDG4_SYSRSTEN             RCC_IWDGC2CFGSETR_IWDG4_SYSRSTEN_Msk                  /*!< Enable of IWDG4 timeout event to reset the application */
#define RCC_IWDGC2CFGSETR_IWDG4_KERRST_Pos           (18U)
#define RCC_IWDGC2CFGSETR_IWDG4_KERRST_Msk           (0x1UL << RCC_IWDGC2CFGSETR_IWDG4_KERRST_Pos)          /*!< 0x00040000 */
#define RCC_IWDGC2CFGSETR_IWDG4_KERRST               RCC_IWDGC2CFGSETR_IWDG4_KERRST_Msk                    /*!< IWDG4 kernel reset */

/* Bit fields for RCC_IWDGC2CFGCLRR register */
#define RCC_IWDGC2CFGCLRR_IWDG3_SYSRSTEN_Pos         (0U)
#define RCC_IWDGC2CFGCLRR_IWDG3_SYSRSTEN_Msk         (0x1UL << RCC_IWDGC2CFGCLRR_IWDG3_SYSRSTEN_Pos)        /*!< 0x00000001 */
#define RCC_IWDGC2CFGCLRR_IWDG3_SYSRSTEN             RCC_IWDGC2CFGCLRR_IWDG3_SYSRSTEN_Msk                  /*!< Clear of IWDG3 timeout event to reset the application */
#define RCC_IWDGC2CFGCLRR_IWDG4_SYSRSTEN_Pos         (2U)
#define RCC_IWDGC2CFGCLRR_IWDG4_SYSRSTEN_Msk         (0x1UL << RCC_IWDGC2CFGCLRR_IWDG4_SYSRSTEN_Pos)        /*!< 0x00000004 */
#define RCC_IWDGC2CFGCLRR_IWDG4_SYSRSTEN             RCC_IWDGC2CFGCLRR_IWDG4_SYSRSTEN_Msk                  /*!< Clear of IWDG4 timeout event to reset the application */
#define RCC_IWDGC2CFGCLRR_IWDG4_KERRST_Pos           (18U)
#define RCC_IWDGC2CFGCLRR_IWDG4_KERRST_Msk           (0x1UL << RCC_IWDGC2CFGCLRR_IWDG4_KERRST_Pos)          /*!< 0x00040000 */
#define RCC_IWDGC2CFGCLRR_IWDG4_KERRST               RCC_IWDGC2CFGCLRR_IWDG4_KERRST_Msk                    /*!< IWDG4 kernel reset */

/* Bit fields for RCC_IWDGC3CFGSETR register */
#define RCC_IWDGC3CFGSETR_IWDG5_SYSRSTEN_Pos         (0U)
#define RCC_IWDGC3CFGSETR_IWDG5_SYSRSTEN_Msk         (0x1UL << RCC_IWDGC3CFGSETR_IWDG5_SYSRSTEN_Pos)        /*!< 0x00000001 */
#define RCC_IWDGC3CFGSETR_IWDG5_SYSRSTEN             RCC_IWDGC3CFGSETR_IWDG5_SYSRSTEN_Msk                  /*!< Enable of IWDG5 timeout event to reset the application */

/* Bit fields for RCC_IWDGC3CFGCLRR register */
#define RCC_IWDGC3CFGCLRR_IWDG5_SYSRSTEN_Pos         (0U)
#define RCC_IWDGC3CFGCLRR_IWDG5_SYSRSTEN_Msk         (0x1UL << RCC_IWDGC3CFGCLRR_IWDG5_SYSRSTEN_Pos)        /*!< 0x00000001 */
#define RCC_IWDGC3CFGCLRR_IWDG5_SYSRSTEN             RCC_IWDGC3CFGCLRR_IWDG5_SYSRSTEN_Msk                  /*!< Clear of IWDG5 timeout event to reset the application */

/* Bit fields for RCC_C3CFGR register */
#define RCC_C3CFGR_C3RST_Pos                         (0U)
#define RCC_C3CFGR_C3RST_Msk                         (0x1UL << RCC_C3CFGR_C3RST_Pos)                        /*!< 0x00000001 */
#define RCC_C3CFGR_C3RST                             RCC_C3CFGR_C3RST_Msk                                  /*!< CPU3 reset */
#define RCC_C3CFGR_C3EN_Pos                          (1U)
#define RCC_C3CFGR_C3EN_Msk                          (0x1UL << RCC_C3CFGR_C3EN_Pos)                         /*!< 0x00000002 */
#define RCC_C3CFGR_C3EN                              RCC_C3CFGR_C3EN_Msk                                   /*!< CPU3 peripheral clocks enable */
#define RCC_C3CFGR_C3LPEN_Pos                        (2U)
#define RCC_C3CFGR_C3LPEN_Msk                        (0x1UL << RCC_C3CFGR_C3LPEN_Pos)                       /*!< 0x00000004 */
#define RCC_C3CFGR_C3LPEN                            RCC_C3CFGR_C3LPEN_Msk                                 /*!< CPU3 peripheral clock enable during CSleep */
#define RCC_C3CFGR_C3AMEN_Pos                        (3U)
#define RCC_C3CFGR_C3AMEN_Msk                        (0x1UL << RCC_C3CFGR_C3AMEN_Pos)                       /*!< 0x00000008 */
#define RCC_C3CFGR_C3AMEN                            RCC_C3CFGR_C3AMEN_Msk                                 /*!< CPU3 autonomous clock mode enable */
#define RCC_C3CFGR_LPTIM3C3EN_Pos                    (16U)
#define RCC_C3CFGR_LPTIM3C3EN_Msk                    (0x1UL << RCC_C3CFGR_LPTIM3C3EN_Pos)                   /*!< 0x00010000 */
#define RCC_C3CFGR_LPTIM3C3EN                        RCC_C3CFGR_LPTIM3C3EN_Msk                             /*!< LPTIM3 allocation to CPU3 enable */
#define RCC_C3CFGR_LPTIM4C3EN_Pos                    (17U)
#define RCC_C3CFGR_LPTIM4C3EN_Msk                    (0x1UL << RCC_C3CFGR_LPTIM4C3EN_Pos)                   /*!< 0x00020000 */
#define RCC_C3CFGR_LPTIM4C3EN                        RCC_C3CFGR_LPTIM4C3EN_Msk                             /*!< LPTIM4 allocation to CPU3 enable */
#define RCC_C3CFGR_LPTIM5C3EN_Pos                    (18U)
#define RCC_C3CFGR_LPTIM5C3EN_Msk                    (0x1UL << RCC_C3CFGR_LPTIM5C3EN_Pos)                   /*!< 0x00040000 */
#define RCC_C3CFGR_LPTIM5C3EN                        RCC_C3CFGR_LPTIM5C3EN_Msk                             /*!< LPTIM5 allocation to CPU3 enable */
#define RCC_C3CFGR_SPI8C3EN_Pos                      (19U)
#define RCC_C3CFGR_SPI8C3EN_Msk                      (0x1UL << RCC_C3CFGR_SPI8C3EN_Pos)                     /*!< 0x00080000 */
#define RCC_C3CFGR_SPI8C3EN                          RCC_C3CFGR_SPI8C3EN_Msk                               /*!< SPI8 allocation to CPU3 enable */
#define RCC_C3CFGR_LPUART1C3EN_Pos                   (20U)
#define RCC_C3CFGR_LPUART1C3EN_Msk                   (0x1UL << RCC_C3CFGR_LPUART1C3EN_Pos)                  /*!< 0x00100000 */
#define RCC_C3CFGR_LPUART1C3EN                       RCC_C3CFGR_LPUART1C3EN_Msk                            /*!< LPUART1 allocation to CPU3 enable */
#define RCC_C3CFGR_I2C8C3EN_Pos                      (21U)
#define RCC_C3CFGR_I2C8C3EN_Msk                      (0x1UL << RCC_C3CFGR_I2C8C3EN_Pos)                     /*!< 0x00200000 */
#define RCC_C3CFGR_I2C8C3EN                          RCC_C3CFGR_I2C8C3EN_Msk                               /*!< I2C8 allocation to CPU3 enable */
#define RCC_C3CFGR_ADF1C3EN_Pos                      (23U)
#define RCC_C3CFGR_ADF1C3EN_Msk                      (0x1UL << RCC_C3CFGR_ADF1C3EN_Pos)                     /*!< 0x00800000 */
#define RCC_C3CFGR_ADF1C3EN                          RCC_C3CFGR_ADF1C3EN_Msk                               /*!< ADF1 allocation to CPU3 enable */
#define RCC_C3CFGR_GPIOZC3EN_Pos                     (24U)
#define RCC_C3CFGR_GPIOZC3EN_Msk                     (0x1UL << RCC_C3CFGR_GPIOZC3EN_Pos)                    /*!< 0x01000000 */
#define RCC_C3CFGR_GPIOZC3EN                         RCC_C3CFGR_GPIOZC3EN_Msk                              /*!< GPIOZ allocation to CPU3 enable */
#define RCC_C3CFGR_LPDMAC3EN_Pos                     (25U)
#define RCC_C3CFGR_LPDMAC3EN_Msk                     (0x1UL << RCC_C3CFGR_LPDMAC3EN_Pos)                    /*!< 0x02000000 */
#define RCC_C3CFGR_LPDMAC3EN                         RCC_C3CFGR_LPDMAC3EN_Msk                              /*!< LPDMA1 allocation to CPU3 enable */
#define RCC_C3CFGR_RTCC3EN_Pos                       (26U)
#define RCC_C3CFGR_RTCC3EN_Msk                       (0x1UL << RCC_C3CFGR_RTCC3EN_Pos)                      /*!< 0x04000000 */
#define RCC_C3CFGR_RTCC3EN                           RCC_C3CFGR_RTCC3EN_Msk                                /*!< RTC allocation to CPU3 enable */
#define RCC_C3CFGR_I3C4C3EN_Pos                      (27U)
#define RCC_C3CFGR_I3C4C3EN_Msk                      (0x1UL << RCC_C3CFGR_I3C4C3EN_Pos)                     /*!< 0x08000000 */
#define RCC_C3CFGR_I3C4C3EN                          RCC_C3CFGR_I3C4C3EN_Msk


/* Bit fields for RCC_MCO1CFGR register */
#define RCC_MCO1CFGR_MCO1SEL_Pos                     (0U)
#define RCC_MCO1CFGR_MCO1SEL_Msk                     (0x1UL << RCC_MCO1CFGR_MCO1SEL_Pos)                    /*!< 0x00000001 */
#define RCC_MCO1CFGR_MCO1SEL                         RCC_MCO1CFGR_MCO1SEL_Msk                              /*!< MCO1 clock output selection */
#define RCC_MCO1CFGR_MCO1ON_Pos                      (8U)
#define RCC_MCO1CFGR_MCO1ON_Msk                      (0x1UL << RCC_MCO1CFGR_MCO1ON_Pos)                     /*!< 0x00000100 */
#define RCC_MCO1CFGR_MCO1ON                          RCC_MCO1CFGR_MCO1ON_Msk                               /*!< Control of MCO1 output */

/* Bit fields for RCC_MCO2CFGR register */
#define RCC_MCO2CFGR_MCO2SEL_Pos                     (0U)
#define RCC_MCO2CFGR_MCO2SEL_Msk                     (0x1UL << RCC_MCO2CFGR_MCO2SEL_Pos)                    /*!< 0x00000001 */
#define RCC_MCO2CFGR_MCO2SEL                         RCC_MCO2CFGR_MCO2SEL_Msk                              /*!< MCO2 clock output selection */
#define RCC_MCO2CFGR_MCO2ON_Pos                      (8U)
#define RCC_MCO2CFGR_MCO2ON_Msk                      (0x1UL << RCC_MCO2CFGR_MCO2ON_Pos)                     /*!< 0x00000100 */
#define RCC_MCO2CFGR_MCO2ON                          RCC_MCO2CFGR_MCO2ON_Msk                               /*!< Control of the MCO2 output */

/* Bit fields for RCC_OCENSETR register */
#define RCC_OCENSETR_HSION_Pos                       (0U)
#define RCC_OCENSETR_HSION_Msk                       (0x1UL << RCC_OCENSETR_HSION_Pos)                      /*!< 0x00000001 */
#define RCC_OCENSETR_HSION                           RCC_OCENSETR_HSION_Msk                                /*!< HSION bit set */
#define RCC_OCENSETR_HSIKERON_Pos                    (1U)
#define RCC_OCENSETR_HSIKERON_Msk                    (0x1UL << RCC_OCENSETR_HSIKERON_Pos)                   /*!< 0x00000002 */
#define RCC_OCENSETR_HSIKERON                        RCC_OCENSETR_HSIKERON_Msk                             /*!< HSIKERON bit set */
#define RCC_OCENSETR_HSEDIV2ON_Pos                   (5U)
#define RCC_OCENSETR_HSEDIV2ON_Msk                   (0x1UL << RCC_OCENSETR_HSEDIV2ON_Pos)                  /*!< 0x00000020 */
#define RCC_OCENSETR_HSEDIV2ON                       RCC_OCENSETR_HSEDIV2ON_Msk                            /*!< HSEDIV2ON bit set */
#define RCC_OCENSETR_HSEDIV2BYP_Pos                  (6U)
#define RCC_OCENSETR_HSEDIV2BYP_Msk                  (0x1UL << RCC_OCENSETR_HSEDIV2BYP_Pos)                 /*!< 0x00000040 */
#define RCC_OCENSETR_HSEDIV2BYP                      RCC_OCENSETR_HSEDIV2BYP_Msk                           /*!< HSEDIV2BYP bit set */
#define RCC_OCENSETR_HSEDIGBYP_Pos                   (7U)
#define RCC_OCENSETR_HSEDIGBYP_Msk                   (0x1UL << RCC_OCENSETR_HSEDIGBYP_Pos)                  /*!< 0x00000080 */
#define RCC_OCENSETR_HSEDIGBYP                       RCC_OCENSETR_HSEDIGBYP_Msk                            /*!< HSEDIGBYP bit set */
#define RCC_OCENSETR_HSEON_Pos                       (8U)
#define RCC_OCENSETR_HSEON_Msk                       (0x1UL << RCC_OCENSETR_HSEON_Pos)                      /*!< 0x00000100 */
#define RCC_OCENSETR_HSEON                           RCC_OCENSETR_HSEON_Msk                                /*!< HSEON bit set */
#define RCC_OCENSETR_HSEKERON_Pos                    (9U)
#define RCC_OCENSETR_HSEKERON_Msk                    (0x1UL << RCC_OCENSETR_HSEKERON_Pos)                   /*!< 0x00000200 */
#define RCC_OCENSETR_HSEKERON                        RCC_OCENSETR_HSEKERON_Msk                             /*!< HSEKERON bit set */
#define RCC_OCENSETR_HSEBYP_Pos                      (10U)
#define RCC_OCENSETR_HSEBYP_Msk                      (0x1UL << RCC_OCENSETR_HSEBYP_Pos)                     /*!< 0x00000400 */
#define RCC_OCENSETR_HSEBYP                          RCC_OCENSETR_HSEBYP_Msk                               /*!< HSEBYP bit set */
#define RCC_OCENSETR_HSECSSON_Pos                    (11U)
#define RCC_OCENSETR_HSECSSON_Msk                    (0x1UL << RCC_OCENSETR_HSECSSON_Pos)                   /*!< 0x00000800 */
#define RCC_OCENSETR_HSECSSON                        RCC_OCENSETR_HSECSSON_Msk                             /*!< HSECSSON bit set */

/* Bit fields for RCC_OCENCLRR register */
#define RCC_OCENCLRR_HSION_Pos                       (0U)
#define RCC_OCENCLRR_HSION_Msk                       (0x1UL << RCC_OCENCLRR_HSION_Pos)                      /*!< 0x00000001 */
#define RCC_OCENCLRR_HSION                           RCC_OCENCLRR_HSION_Msk                                /*!< HSION bit clear */
#define RCC_OCENCLRR_HSIKERON_Pos                    (1U)
#define RCC_OCENCLRR_HSIKERON_Msk                    (0x1UL << RCC_OCENCLRR_HSIKERON_Pos)                   /*!< 0x00000002 */
#define RCC_OCENCLRR_HSIKERON                        RCC_OCENCLRR_HSIKERON_Msk                             /*!< HSIKERON bit clear */
#define RCC_OCENCLRR_HSEDIV2ON_Pos                   (5U)
#define RCC_OCENCLRR_HSEDIV2ON_Msk                   (0x1UL << RCC_OCENCLRR_HSEDIV2ON_Pos)                  /*!< 0x00000020 */
#define RCC_OCENCLRR_HSEDIV2ON                       RCC_OCENCLRR_HSEDIV2ON_Msk                            /*!< HSEDIV2ON bit clear */
#define RCC_OCENCLRR_HSEDIV2BYP_Pos                  (6U)
#define RCC_OCENCLRR_HSEDIV2BYP_Msk                  (0x1UL << RCC_OCENCLRR_HSEDIV2BYP_Pos)                 /*!< 0x00000040 */
#define RCC_OCENCLRR_HSEDIV2BYP                      RCC_OCENCLRR_HSEDIV2BYP_Msk                           /*!< HSEDIV2BYP bit clear */
#define RCC_OCENCLRR_HSEDIGBYP_Pos                   (7U)
#define RCC_OCENCLRR_HSEDIGBYP_Msk                   (0x1UL << RCC_OCENCLRR_HSEDIGBYP_Pos)                  /*!< 0x00000080 */
#define RCC_OCENCLRR_HSEDIGBYP                       RCC_OCENCLRR_HSEDIGBYP_Msk                            /*!< HSEDIGBYP bit clear */
#define RCC_OCENCLRR_HSEON_Pos                       (8U)
#define RCC_OCENCLRR_HSEON_Msk                       (0x1UL << RCC_OCENCLRR_HSEON_Pos)                      /*!< 0x00000100 */
#define RCC_OCENCLRR_HSEON                           RCC_OCENCLRR_HSEON_Msk                                /*!< HSEON bit clear */
#define RCC_OCENCLRR_HSEKERON_Pos                    (9U)
#define RCC_OCENCLRR_HSEKERON_Msk                    (0x1UL << RCC_OCENCLRR_HSEKERON_Pos)                   /*!< 0x00000200 */
#define RCC_OCENCLRR_HSEKERON                        RCC_OCENCLRR_HSEKERON_Msk                             /*!< HSEKERON bit clear */
#define RCC_OCENCLRR_HSEBYP_Pos                      (10U)
#define RCC_OCENCLRR_HSEBYP_Msk                      (0x1UL << RCC_OCENCLRR_HSEBYP_Pos)                     /*!< 0x00000400 */
#define RCC_OCENCLRR_HSEBYP                          RCC_OCENCLRR_HSEBYP_Msk                               /*!< HSEBYP bit clear */

