STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253axx_cm33.h
/*******************  Bits definition for RISAB_CIDxRDCFGR register ***********/
#define RISAB_CIDRDCFGR_PRDEN_Pos     (0U)
#define RISAB_CIDRDCFGR_PRDEN_Msk     (0xFFFFFFFFUL << RISAB_CIDRDCFGR_PRDEN_Pos) /*!< 0xFFFFFFFF */
#define RISAB_CIDRDCFGR_PRDEN         RISAB_CIDRDCFGR_PRDEN_Msk
#define RISAB_CIDRDCFGR_PRDEN0_Pos    (0U)
#define RISAB_CIDRDCFGR_PRDEN0_Msk    (0x1UL << RISAB_CIDRDCFGR_PRDEN0_Pos)      /*!< 0x00000001 */
#define RISAB_CIDRDCFGR_PRDEN0        RISAB_CIDRDCFGR_PRDEN0_Msk
#define RISAB_CIDRDCFGR_PRDEN1_Pos    (1U)
#define RISAB_CIDRDCFGR_PRDEN1_Msk    (0x1UL << RISAB_CIDRDCFGR_PRDEN1_Pos)      /*!< 0x00000002 */
#define RISAB_CIDRDCFGR_PRDEN1         RISAB_CIDRDCFGR_PRDEN1_Msk
#define RISAB_CIDRDCFGR_PRDEN2_Pos    (2U)
#define RISAB_CIDRDCFGR_PRDEN2_Msk    (0x1UL << RISAB_CIDRDCFGR_PRDEN2_Pos)      /*!< 0x00000004 */
#define RISAB_CIDRDCFGR_PRDEN2        RISAB_CIDRDCFGR_PRDEN2_Msk
#define RISAB_CIDRDCFGR_PRDEN3_Pos    (3U)
#define RISAB_CIDRDCFGR_PRDEN3_Msk    (0x1UL << RISAB_CIDRDCFGR_PRDEN3_Pos)      /*!< 0x00000008 */
#define RISAB_CIDRDCFGR_PRDEN3        RISAB_CIDRDCFGR_PRDEN3_Msk
#define RISAB_CIDRDCFGR_PRDEN4_Pos    (4U)
#define RISAB_CIDRDCFGR_PRDEN4_Msk    (0x1UL << RISAB_CIDRDCFGR_PRDEN4_Pos)      /*!< 0x00000010 */
#define RISAB_CIDRDCFGR_PRDEN4        RISAB_CIDRDCFGR_PRDEN4_Msk
#define RISAB_CIDRDCFGR_PRDEN5_Pos    (5U)
#define RISAB_CIDRDCFGR_PRDEN5_Msk    (0x1UL << RISAB_CIDRDCFGR_PRDEN5_Pos)      /*!< 0x00000020 */
#define RISAB_CIDRDCFGR_PRDEN5        RISAB_CIDRDCFGR_PRDEN5_Msk
#define RISAB_CIDRDCFGR_PRDEN6_Pos    (6U)
#define RISAB_CIDRDCFGR_PRDEN6_Msk    (0x1UL << RISAB_CIDRDCFGR_PRDEN6_Pos)      /*!< 0x00000040 */
#define RISAB_CIDRDCFGR_PRDEN6        RISAB_CIDRDCFGR_PRDEN6_Msk
#define RISAB_CIDRDCFGR_PRDEN7_Pos    (7U)
#define RISAB_CIDRDCFGR_PRDEN7_Msk    (0x1UL << RISAB_CIDRDCFGR_PRDEN7_Pos)      /*!< 0x00000080 */
#define RISAB_CIDRDCFGR_PRDEN7        RISAB_CIDRDCFGR_PRDEN7_Msk
#define RISAB_CIDRDCFGR_PRDEN8_Pos    (8U)
#define RISAB_CIDRDCFGR_PRDEN8_Msk    (0x1UL << RISAB_CIDRDCFGR_PRDEN8_Pos)      /*!< 0x00000100 */
#define RISAB_CIDRDCFGR_PRDEN8        RISAB_CIDRDCFGR_PRDEN8_Msk
#define RISAB_CIDRDCFGR_PRDEN9_Pos    (9U)
#define RISAB_CIDRDCFGR_PRDEN9_Msk    (0x1UL << RISAB_CIDRDCFGR_PRDEN9_Pos)      /*!< 0x00000200 */
#define RISAB_CIDRDCFGR_PRDEN9        RISAB_CIDRDCFGR_PRDEN9_Msk
#define RISAB_CIDRDCFGR_PRDEN10_Pos   (10U)
#define RISAB_CIDRDCFGR_PRDEN10_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN10_Pos)     /*!< 0x00000400 */
#define RISAB_CIDRDCFGR_PRDEN10       RISAB_CIDRDCFGR_PRDEN10_Msk
#define RISAB_CIDRDCFGR_PRDEN11_Pos   (11U)
#define RISAB_CIDRDCFGR_PRDEN11_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN11_Pos)     /*!< 0x00000800 */
#define RISAB_CIDRDCFGR_PRDEN11       RISAB_CIDRDCFGR_PRDEN11_Msk
#define RISAB_CIDRDCFGR_PRDEN12_Pos   (12U)
#define RISAB_CIDRDCFGR_PRDEN12_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN12_Pos)     /*!< 0x00001000 */
#define RISAB_CIDRDCFGR_PRDEN12       RISAB_CIDRDCFGR_PRDEN12_Msk
#define RISAB_CIDRDCFGR_PRDEN13_Pos   (13U)
#define RISAB_CIDRDCFGR_PRDEN13_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN13_Pos)     /*!< 0x00002000 */
#define RISAB_CIDRDCFGR_PRDEN13       RISAB_CIDRDCFGR_PRDEN13_Msk
#define RISAB_CIDRDCFGR_PRDEN14_Pos   (14U)
#define RISAB_CIDRDCFGR_PRDEN14_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN14_Pos)     /*!< 0x00004000 */
#define RISAB_CIDRDCFGR_PRDEN14       RISAB_CIDRDCFGR_PRDEN14_Msk
#define RISAB_CIDRDCFGR_PRDEN15_Pos   (15U)
#define RISAB_CIDRDCFGR_PRDEN15_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN15_Pos)     /*!< 0x00008000 */
#define RISAB_CIDRDCFGR_PRDEN15       RISAB_CIDRDCFGR_PRDEN15_Msk
#define RISAB_CIDRDCFGR_PRDEN16_Pos   (16U)
#define RISAB_CIDRDCFGR_PRDEN16_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN16_Pos)     /*!< 0x00010000 */
#define RISAB_CIDRDCFGR_PRDEN16       RISAB_CIDRDCFGR_PRDEN16_Msk
#define RISAB_CIDRDCFGR_PRDEN17_Pos   (17U)
#define RISAB_CIDRDCFGR_PRDEN17_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN17_Pos)     /*!< 0x00020000 */
#define RISAB_CIDRDCFGR_PRDEN17       RISAB_CIDRDCFGR_PRDEN17_Msk
#define RISAB_CIDRDCFGR_PRDEN18_Pos   (18U)
#define RISAB_CIDRDCFGR_PRDEN18_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN18_Pos)     /*!< 0x00040000 */
#define RISAB_CIDRDCFGR_PRDEN18       RISAB_CIDRDCFGR_PRDEN18_Msk
#define RISAB_CIDRDCFGR_PRDEN19_Pos   (19U)
#define RISAB_CIDRDCFGR_PRDEN19_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN19_Pos)     /*!< 0x00080000 */
#define RISAB_CIDRDCFGR_PRDEN19       RISAB_CIDRDCFGR_PRDEN19_Msk
#define RISAB_CIDRDCFGR_PRDEN20_Pos   (20U)
#define RISAB_CIDRDCFGR_PRDEN20_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN20_Pos)     /*!< 0x00100000 */
#define RISAB_CIDRDCFGR_PRDEN20       RISAB_CIDRDCFGR_PRDEN20_Msk
#define RISAB_CIDRDCFGR_PRDEN21_Pos   (21U)
#define RISAB_CIDRDCFGR_PRDEN21_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN21_Pos)     /*!< 0x00200000 */
#define RISAB_CIDRDCFGR_PRDEN21       RISAB_CIDRDCFGR_PRDEN21_Msk
#define RISAB_CIDRDCFGR_PRDEN22_Pos   (22U)
#define RISAB_CIDRDCFGR_PRDEN22_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN22_Pos)     /*!< 0x00400000 */
#define RISAB_CIDRDCFGR_PRDEN22       RISAB_CIDRDCFGR_PRDEN22_Msk
#define RISAB_CIDRDCFGR_PRDEN23_Pos   (23U)
#define RISAB_CIDRDCFGR_PRDEN23_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN23_Pos)     /*!< 0x00800000 */
#define RISAB_CIDRDCFGR_PRDEN23       RISAB_CIDRDCFGR_PRDEN23_Msk
#define RISAB_CIDRDCFGR_PRDEN24_Pos   (24U)
#define RISAB_CIDRDCFGR_PRDEN24_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN24_Pos)     /*!< 0x01000000 */
#define RISAB_CIDRDCFGR_PRDEN24       RISAB_CIDRDCFGR_PRDEN24_Msk
#define RISAB_CIDRDCFGR_PRDEN25_Pos   (25U)
#define RISAB_CIDRDCFGR_PRDEN25_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN25_Pos)     /*!< 0x02000000 */
#define RISAB_CIDRDCFGR_PRDEN25       RISAB_CIDRDCFGR_PRDEN25_Msk
#define RISAB_CIDRDCFGR_PRDEN26_Pos   (26U)
#define RISAB_CIDRDCFGR_PRDEN26_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN26_Pos)     /*!< 0x04000000 */
#define RISAB_CIDRDCFGR_PRDEN26       RISAB_CIDRDCFGR_PRDEN26_Msk
#define RISAB_CIDRDCFGR_PRDEN27_Pos   (27U)
#define RISAB_CIDRDCFGR_PRDEN27_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN27_Pos)     /*!< 0x08000000 */
#define RISAB_CIDRDCFGR_PRDEN27       RISAB_CIDRDCFGR_PRDEN27_Msk
#define RISAB_CIDRDCFGR_PRDEN28_Pos   (28U)
#define RISAB_CIDRDCFGR_PRDEN28_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN28_Pos)     /*!< 0x10000000 */
#define RISAB_CIDRDCFGR_PRDEN28       RISAB_CIDRDCFGR_PRDEN28_Msk
#define RISAB_CIDRDCFGR_PRDEN29_Pos   (29U)
#define RISAB_CIDRDCFGR_PRDEN29_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN29_Pos)     /*!< 0x20000000 */
#define RISAB_CIDRDCFGR_PRDEN29       RISAB_CIDRDCFGR_PRDEN29_Msk
#define RISAB_CIDRDCFGR_PRDEN30_Pos   (30U)
#define RISAB_CIDRDCFGR_PRDEN30_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN30_Pos)     /*!< 0x40000000 */
#define RISAB_CIDRDCFGR_PRDEN30       RISAB_CIDRDCFGR_PRDEN30_Msk
#define RISAB_CIDRDCFGR_PRDEN31_Pos   (31U)
#define RISAB_CIDRDCFGR_PRDEN31_Msk   (0x1UL << RISAB_CIDRDCFGR_PRDEN31_Pos)     /*!< 0x80000000 */
#define RISAB_CIDRDCFGR_PRDEN31       RISAB_CIDRDCFGR_PRDEN31_Msk

/*******************  Bits definition for RISAB_CIDxWRCFGR register ***********/
#define RISAB_CIDWRCFGR_PWREN_Pos     (0U)
#define RISAB_CIDWRCFGR_PWREN_Msk     (0xFFFFFFFFUL << RISAB_CIDWRCFGR_PWREN_Pos) /*!< 0xFFFFFFFF */
#define RISAB_CIDWRCFGR_PWREN         RISAB_CIDWRCFGR_PWREN_Msk
#define RISAB_CIDWRCFGR_PWREN0_Pos    (0U)
#define RISAB_CIDWRCFGR_PWREN0_Msk    (0x1UL << RISAB_CIDWRCFGR_PWREN0_Pos)      /*!< 0x00000001 */
#define RISAB_CIDWRCFGR_PWREN0        RISAB_CIDWRCFGR_PWREN0_Msk
#define RISAB_CIDWRCFGR_PWREN1_Pos    (1U)
#define RISAB_CIDWRCFGR_PWREN1_Msk    (0x1UL << RISAB_CIDWRCFGR_PWREN1_Pos)      /*!< 0x00000002 */
#define RISAB_CIDWRCFGR_PWREN1        RISAB_CIDWRCFGR_PWREN1_Msk
#define RISAB_CIDWRCFGR_PWREN2_Pos    (2U)
#define RISAB_CIDWRCFGR_PWREN2_Msk    (0x1UL << RISAB_CIDWRCFGR_PWREN2_Pos)      /*!< 0x00000004 */
#define RISAB_CIDWRCFGR_PWREN2        RISAB_CIDWRCFGR_PWREN2_Msk
#define RISAB_CIDWRCFGR_PWREN3_Pos    (3U)
#define RISAB_CIDWRCFGR_PWREN3_Msk    (0x1UL << RISAB_CIDWRCFGR_PWREN3_Pos)      /*!< 0x00000008 */
#define RISAB_CIDWRCFGR_PWREN3        RISAB_CIDWRCFGR_PWREN3_Msk
#define RISAB_CIDWRCFGR_PWREN4_Pos    (4U)
#define RISAB_CIDWRCFGR_PWREN4_Msk    (0x1UL << RISAB_CIDWRCFGR_PWREN4_Pos)      /*!< 0x00000010 */
#define RISAB_CIDWRCFGR_PWREN4        RISAB_CIDWRCFGR_PWREN4_Msk
#define RISAB_CIDWRCFGR_PWREN5_Pos    (5U)
#define RISAB_CIDWRCFGR_PWREN5_Msk    (0x1UL << RISAB_CIDWRCFGR_PWREN5_Pos)      /*!< 0x00000020 */
#define RISAB_CIDWRCFGR_PWREN5        RISAB_CIDWRCFGR_PWREN5_Msk
#define RISAB_CIDWRCFGR_PWREN6_Pos    (6U)
#define RISAB_CIDWRCFGR_PWREN6_Msk    (0x1UL << RISAB_CIDWRCFGR_PWREN6_Pos)      /*!< 0x00000040 */
#define RISAB_CIDWRCFGR_PWREN6        RISAB_CIDWRCFGR_PWREN6_Msk
#define RISAB_CIDWRCFGR_PWREN7_Pos    (7U)
#define RISAB_CIDWRCFGR_PWREN7_Msk    (0x1UL << RISAB_CIDWRCFGR_PWREN7_Pos)      /*!< 0x00000080 */
#define RISAB_CIDWRCFGR_PWREN7        RISAB_CIDWRCFGR_PWREN7_Msk
#define RISAB_CIDWRCFGR_PWREN8_Pos    (8U)
#define RISAB_CIDWRCFGR_PWREN8_Msk    (0x1UL << RISAB_CIDWRCFGR_PWREN8_Pos)      /*!< 0x00000100 */
#define RISAB_CIDWRCFGR_PWREN8        RISAB_CIDWRCFGR_PWREN8_Msk
#define RISAB_CIDWRCFGR_PWREN9_Pos    (9U)
#define RISAB_CIDWRCFGR_PWREN9_Msk    (0x1UL << RISAB_CIDWRCFGR_PWREN9_Pos)      /*!< 0x00000200 */
#define RISAB_CIDWRCFGR_PWREN9        RISAB_CIDWRCFGR_PWREN9_Msk
#define RISAB_CIDWRCFGR_PWREN10_Pos   (10U)
#define RISAB_CIDWRCFGR_PWREN10_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN10_Pos)     /*!< 0x00000400 */
#define RISAB_CIDWRCFGR_PWREN10       RISAB_CIDWRCFGR_PWREN10_Msk
#define RISAB_CIDWRCFGR_PWREN11_Pos   (11U)
#define RISAB_CIDWRCFGR_PWREN11_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN11_Pos)     /*!< 0x00000800 */
#define RISAB_CIDWRCFGR_PWREN11       RISAB_CIDWRCFGR_PWREN11_Msk
#define RISAB_CIDWRCFGR_PWREN12_Pos   (12U)
#define RISAB_CIDWRCFGR_PWREN12_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN12_Pos)     /*!< 0x00001000 */
#define RISAB_CIDWRCFGR_PWREN12       RISAB_CIDWRCFGR_PWREN12_Msk
#define RISAB_CIDWRCFGR_PWREN13_Pos   (13U)
#define RISAB_CIDWRCFGR_PWREN13_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN13_Pos)     /*!< 0x00002000 */
#define RISAB_CIDWRCFGR_PWREN13       RISAB_CIDWRCFGR_PWREN13_Msk
#define RISAB_CIDWRCFGR_PWREN14_Pos   (14U)
#define RISAB_CIDWRCFGR_PWREN14_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN14_Pos)     /*!< 0x00004000 */
#define RISAB_CIDWRCFGR_PWREN14       RISAB_CIDWRCFGR_PWREN14_Msk
#define RISAB_CIDWRCFGR_PWREN15_Pos   (15U)
#define RISAB_CIDWRCFGR_PWREN15_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN15_Pos)     /*!< 0x00008000 */
#define RISAB_CIDWRCFGR_PWREN15       RISAB_CIDWRCFGR_PWREN15_Msk
#define RISAB_CIDWRCFGR_PWREN16_Pos   (16U)
#define RISAB_CIDWRCFGR_PWREN16_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN16_Pos)     /*!< 0x00010000 */
#define RISAB_CIDWRCFGR_PWREN16       RISAB_CIDWRCFGR_PWREN16_Msk
#define RISAB_CIDWRCFGR_PWREN17_Pos   (17U)
#define RISAB_CIDWRCFGR_PWREN17_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN17_Pos)     /*!< 0x00020000 */
#define RISAB_CIDWRCFGR_PWREN17       RISAB_CIDWRCFGR_PWREN17_Msk
#define RISAB_CIDWRCFGR_PWREN18_Pos   (18U)
#define RISAB_CIDWRCFGR_PWREN18_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN18_Pos)     /*!< 0x00040000 */
#define RISAB_CIDWRCFGR_PWREN18       RISAB_CIDWRCFGR_PWREN18_Msk
#define RISAB_CIDWRCFGR_PWREN19_Pos   (19U)
#define RISAB_CIDWRCFGR_PWREN19_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN19_Pos)     /*!< 0x00080000 */
#define RISAB_CIDWRCFGR_PWREN19       RISAB_CIDWRCFGR_PWREN19_Msk
#define RISAB_CIDWRCFGR_PWREN20_Pos   (20U)
#define RISAB_CIDWRCFGR_PWREN20_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN20_Pos)     /*!< 0x00100000 */
#define RISAB_CIDWRCFGR_PWREN20       RISAB_CIDWRCFGR_PWREN20_Msk
#define RISAB_CIDWRCFGR_PWREN21_Pos   (21U)
#define RISAB_CIDWRCFGR_PWREN21_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN21_Pos)     /*!< 0x00200000 */
#define RISAB_CIDWRCFGR_PWREN21       RISAB_CIDWRCFGR_PWREN21_Msk
#define RISAB_CIDWRCFGR_PWREN22_Pos   (22U)
#define RISAB_CIDWRCFGR_PWREN22_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN22_Pos)     /*!< 0x00400000 */
#define RISAB_CIDWRCFGR_PWREN22       RISAB_CIDWRCFGR_PWREN22_Msk
#define RISAB_CIDWRCFGR_PWREN23_Pos   (23U)
#define RISAB_CIDWRCFGR_PWREN23_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN23_Pos)     /*!< 0x00800000 */
#define RISAB_CIDWRCFGR_PWREN23       RISAB_CIDWRCFGR_PWREN23_Msk
#define RISAB_CIDWRCFGR_PWREN24_Pos   (24U)
#define RISAB_CIDWRCFGR_PWREN24_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN24_Pos)     /*!< 0x01000000 */
#define RISAB_CIDWRCFGR_PWREN24       RISAB_CIDWRCFGR_PWREN24_Msk
#define RISAB_CIDWRCFGR_PWREN25_Pos   (25U)
#define RISAB_CIDWRCFGR_PWREN25_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN25_Pos)     /*!< 0x02000000 */
#define RISAB_CIDWRCFGR_PWREN25       RISAB_CIDWRCFGR_PWREN25_Msk
#define RISAB_CIDWRCFGR_PWREN26_Pos   (26U)
#define RISAB_CIDWRCFGR_PWREN26_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN26_Pos)     /*!< 0x04000000 */
#define RISAB_CIDWRCFGR_PWREN26       RISAB_CIDWRCFGR_PWREN26_Msk
#define RISAB_CIDWRCFGR_PWREN27_Pos   (27U)
#define RISAB_CIDWRCFGR_PWREN27_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN27_Pos)     /*!< 0x08000000 */
#define RISAB_CIDWRCFGR_PWREN27       RISAB_CIDWRCFGR_PWREN27_Msk
#define RISAB_CIDWRCFGR_PWREN28_Pos   (28U)
#define RISAB_CIDWRCFGR_PWREN28_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN28_Pos)     /*!< 0x10000000 */
#define RISAB_CIDWRCFGR_PWREN28       RISAB_CIDWRCFGR_PWREN28_Msk
#define RISAB_CIDWRCFGR_PWREN29_Pos   (29U)
#define RISAB_CIDWRCFGR_PWREN29_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN29_Pos)     /*!< 0x20000000 */
#define RISAB_CIDWRCFGR_PWREN29       RISAB_CIDWRCFGR_PWREN29_Msk
#define RISAB_CIDWRCFGR_PWREN30_Pos   (30U)
#define RISAB_CIDWRCFGR_PWREN30_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN30_Pos)     /*!< 0x40000000 */
#define RISAB_CIDWRCFGR_PWREN30       RISAB_CIDWRCFGR_PWREN30_Msk
#define RISAB_CIDWRCFGR_PWREN31_Pos   (31U)
#define RISAB_CIDWRCFGR_PWREN31_Msk   (0x1UL << RISAB_CIDWRCFGR_PWREN31_Pos)     /*!< 0x80000000 */
#define RISAB_CIDWRCFGR_PWREN31       RISAB_CIDWRCFGR_PWREN31_Msk

/*******************  Bits definition for RISAB_PGx_CIDCFGR register **********/
#define RISAB_PGCIDCFGR_CFEN_Pos      (0U)
#define RISAB_PGCIDCFGR_CFEN_Msk      (0x1UL << RISAB_PGCIDCFGR_CFEN_Pos)        /*!< 0x00000001 */
#define RISAB_PGCIDCFGR_CFEN          RISAB_PGCIDCFGR_CFEN_Msk

#define RISAB_PGCIDCFGR_DCEN_Pos      (2U)
#define RISAB_PGCIDCFGR_DCEN_Msk      (0x1UL << RISAB_PGCIDCFGR_DCEN_Pos)        /*!< 0x00000004 */
#define RISAB_PGCIDCFGR_DCEN          RISAB_PGCIDCFGR_DCEN_Msk

#define RISAB_PGCIDCFGR_DCCID_Pos     (4U)
#define RISAB_PGCIDCFGR_DCCID_Msk     (0x7UL << RISAB_PGCIDCFGR_DCCID_Pos)       /*!< 0x00000070 */
#define RISAB_PGCIDCFGR_DCCID         RISAB_PGCIDCFGR_DCCID_Msk
#define RISAB_PGCIDCFGR_DCCIDC0       (0x0UL << RISAB_PGCIDCFGR_DCCID_Pos)       /*!< 0x00000000 */
#define RISAB_PGCIDCFGR_DCCIDC1       (0x1UL << RISAB_PGCIDCFGR_DCCID_Pos)       /*!< 0x00000010 */
#define RISAB_PGCIDCFGR_DCCIDC2       (0x2UL << RISAB_PGCIDCFGR_DCCID_Pos)       /*!< 0x00000020 */
#define RISAB_PGCIDCFGR_DCCIDC3       (0x3UL << RISAB_PGCIDCFGR_DCCID_Pos)       /*!< 0x00000030 */
#define RISAB_PGCIDCFGR_DCCIDC4       (0x4UL << RISAB_PGCIDCFGR_DCCID_Pos)       /*!< 0x00000040 */
#define RISAB_PGCIDCFGR_DCCIDC5       (0x5UL << RISAB_PGCIDCFGR_DCCID_Pos)       /*!< 0x00000050 */
#define RISAB_PGCIDCFGR_DCCIDC6       (0x6UL << RISAB_PGCIDCFGR_DCCID_Pos)       /*!< 0x00000060 */
#define RISAB_PGCIDCFGR_DCCIDC7       (0x7UL << RISAB_PGCIDCFGR_DCCID_Pos)       /*!< 0x00000070 */

/*******************  Bits definition for RISAB_VERR register *****************/
#define RISAB_VERR_MINREV_Pos         (0U)
#define RISAB_VERR_MINREV_Msk         (0xFUL << RISAB_VERR_MINREV_Pos)           /*!< 0x0000000F */
#define RISAB_VERR_MINREV             RISAB_VERR_MINREV_Msk

#define RISAB_VERR_MAJREV_Pos         (4U)
#define RISAB_VERR_MAJREV_Msk         (0xFUL << RISAB_VERR_MAJREV_Pos)           /*!< 0x000000F0 */
#define RISAB_VERR_MAJREV             RISAB_VERR_MAJREV_Msk

/*******************  Bits definition for RISAB_IPIDR register ****************/
#define RISAB_IPIDR_ID_Pos            (0U)
#define RISAB_IPIDR_ID_Msk            (0xFFFFFFFFUL << RISAB_IPIDR_ID_Pos)       /*!< 0xFFFFFFFF */
#define RISAB_IPIDR_ID                RISAB_IPIDR_ID_Msk

/*******************  Bits definition for RISAB_SIDR register *****************/
#define RISAB_SIDR_SID_Pos            (0U)
#define RISAB_SIDR_SID_Msk            (0xFFFFFFFFUL << RISAB_SIDR_SID_Pos)       /*!< 0xFFFFFFFF */
#define RISAB_SIDR_SID                RISAB_SIDR_SID_Msk

