STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253axx_cm33.h
/***************  Bit definition for SYSCFG_DLYBSD1SR register  ***************/
#define SYSCFG_DLYBSD1SR_LOCK_Pos                                          (0U)
#define SYSCFG_DLYBSD1SR_LOCK_Msk                                          (0x1UL << SYSCFG_DLYBSD1SR_LOCK_Pos)                                            /*!< 0x00000001 */
#define SYSCFG_DLYBSD1SR_LOCK                                              SYSCFG_DLYBSD1SR_LOCK_Msk                                                      /*!< When 1, DLL is locked */
#define SYSCFG_DLYBSD1SR_RX_TAP_SEL_ACK_Pos                                (1U)
#define SYSCFG_DLYBSD1SR_RX_TAP_SEL_ACK_Msk                                (0x1UL << SYSCFG_DLYBSD1SR_RX_TAP_SEL_ACK_Pos)                                  /*!< 0x00000002 */
#define SYSCFG_DLYBSD1SR_RX_TAP_SEL_ACK                                    SYSCFG_DLYBSD1SR_RX_TAP_SEL_ACK_Msk                                            /*!< When â1â, the RX delay has switched to the tap value specified in RX_TAP_SEL[5:0] */

/***************  Bit definition for SYSCFG_SDMMC1CR register  ****************/
#define SYSCFG_SDMMC1CR_SDMMC1_VSEL_Pos                                    (0U)
#define SYSCFG_SDMMC1CR_SDMMC1_VSEL_Msk                                    (0x1UL << SYSCFG_SDMMC1CR_SDMMC1_VSEL_Pos)                                      /*!< 0x00000001 */
#define SYSCFG_SDMMC1CR_SDMMC1_VSEL                                        SYSCFG_SDMMC1CR_SDMMC1_VSEL_Msk                                                /*!< Voltage Selection */
#define SYSCFG_SDMMC1CR_HSLVEN_SDMMC1_Pos                                  (1U)
#define SYSCFG_SDMMC1CR_HSLVEN_SDMMC1_Msk                                  (0x1UL << SYSCFG_SDMMC1CR_HSLVEN_SDMMC1_Pos)                                    /*!< 0x00000002 */
#define SYSCFG_SDMMC1CR_HSLVEN_SDMMC1                                      SYSCFG_SDMMC1CR_HSLVEN_SDMMC1_Msk                                              /*!< High Speed Low Voltage Pad mode Enable */

/***************  Bit definition for SYSCFG_DLYBSD2CR register  ***************/
#define SYSCFG_DLYBSD2CR_EN_Pos                                            (0U)
#define SYSCFG_DLYBSD2CR_EN_Msk                                            (0x1UL << SYSCFG_DLYBSD2CR_EN_Pos)                                              /*!< 0x00000001 */
#define SYSCFG_DLYBSD2CR_EN                                                SYSCFG_DLYBSD2CR_EN_Msk                                                        /*!< When 1, DLL is enabled */
#define SYSCFG_DLYBSD2CR_RX_TAP_SEL_Pos                                    (1U)
#define SYSCFG_DLYBSD2CR_RX_TAP_SEL_Msk                                    (0x3FUL << SYSCFG_DLYBSD2CR_RX_TAP_SEL_Pos)                                     /*!< 0x0000007E */
#define SYSCFG_DLYBSD2CR_RX_TAP_SEL                                        SYSCFG_DLYBSD2CR_RX_TAP_SEL_Msk                                                /*!< selection of TAP delay for RX clock */
#define SYSCFG_DLYBSD2CR_BYP_EN_Pos                                        (16U)
#define SYSCFG_DLYBSD2CR_BYP_EN_Msk                                        (0x1UL << SYSCFG_DLYBSD2CR_BYP_EN_Pos)                                          /*!< 0x00010000 */
#define SYSCFG_DLYBSD2CR_BYP_EN                                            SYSCFG_DLYBSD2CR_BYP_EN_Msk                                                    /*!< When 1, DLL bypass mode is enabled */
#define SYSCFG_DLYBSD2CR_BYP_CMD_Pos                                       (17U)
#define SYSCFG_DLYBSD2CR_BYP_CMD_Msk                                       (0x1FUL << SYSCFG_DLYBSD2CR_BYP_CMD_Pos)                                        /*!< 0x003E0000 */
#define SYSCFG_DLYBSD2CR_BYP_CMD                                           SYSCFG_DLYBSD2CR_BYP_CMD_Msk                                                   /*!< value of the delay unit when in DLL bypass mode */
#define SYSCFG_DLYBSD2CR_ANTIGLITCH_EN_Pos                                 (22U)
#define SYSCFG_DLYBSD2CR_ANTIGLITCH_EN_Msk                                 (0x1UL << SYSCFG_DLYBSD2CR_ANTIGLITCH_EN_Pos)                                   /*!< 0x00400000 */
#define SYSCFG_DLYBSD2CR_ANTIGLITCH_EN                                     SYSCFG_DLYBSD2CR_ANTIGLITCH_EN_Msk                                             /*!< When 1, the anti-glitch logic is enabled */

/***************  Bit definition for SYSCFG_DLYBSD2SR register  ***************/
#define SYSCFG_DLYBSD2SR_LOCK_Pos                                          (0U)
#define SYSCFG_DLYBSD2SR_LOCK_Msk                                          (0x1UL << SYSCFG_DLYBSD2SR_LOCK_Pos)                                            /*!< 0x00000001 */
#define SYSCFG_DLYBSD2SR_LOCK                                              SYSCFG_DLYBSD2SR_LOCK_Msk                                                      /*!< When 1, DLL is locked */
#define SYSCFG_DLYBSD2SR_RX_TAP_SEL_ACK_Pos                                (1U)
#define SYSCFG_DLYBSD2SR_RX_TAP_SEL_ACK_Msk                                (0x1UL << SYSCFG_DLYBSD2SR_RX_TAP_SEL_ACK_Pos)                                  /*!< 0x00000002 */
#define SYSCFG_DLYBSD2SR_RX_TAP_SEL_ACK                                    SYSCFG_DLYBSD2SR_RX_TAP_SEL_ACK_Msk                                            /*!< When â1â, the RX delay has switched to the tap value specified in RX_TAP_SEL[5:0] */

/***************  Bit definition for SYSCFG_SDMMC2CR register  ****************/
#define SYSCFG_SDMMC2CR_SDMMC2_VSEL_Pos                                    (0U)
#define SYSCFG_SDMMC2CR_SDMMC2_VSEL_Msk                                    (0x1UL << SYSCFG_SDMMC2CR_SDMMC2_VSEL_Pos)                                      /*!< 0x00000001 */
#define SYSCFG_SDMMC2CR_SDMMC2_VSEL                                        SYSCFG_SDMMC2CR_SDMMC2_VSEL_Msk                                                /*!< Voltage Selection */
#define SYSCFG_SDMMC2CR_HSLVEN_SDMMC2_Pos                                  (1U)
#define SYSCFG_SDMMC2CR_HSLVEN_SDMMC2_Msk                                  (0x1UL << SYSCFG_SDMMC2CR_HSLVEN_SDMMC2_Pos)                                    /*!< 0x00000002 */
#define SYSCFG_SDMMC2CR_HSLVEN_SDMMC2                                      SYSCFG_SDMMC2CR_HSLVEN_SDMMC2_Msk                                              /*!< High Speed Low Voltage Pad mode Enable */

/***************  Bit definition for SYSCFG_DLYBSD3CR register  ***************/
#define SYSCFG_DLYBSD3CR_EN_Pos                                            (0U)
#define SYSCFG_DLYBSD3CR_EN_Msk                                            (0x1UL << SYSCFG_DLYBSD3CR_EN_Pos)                                              /*!< 0x00000001 */
#define SYSCFG_DLYBSD3CR_EN                                                SYSCFG_DLYBSD3CR_EN_Msk                                                        /*!< When 1, DLL is enabled */
#define SYSCFG_DLYBSD3CR_RX_TAP_SEL_Pos                                    (1U)
#define SYSCFG_DLYBSD3CR_RX_TAP_SEL_Msk                                    (0x3FUL << SYSCFG_DLYBSD3CR_RX_TAP_SEL_Pos)                                     /*!< 0x0000007E */
#define SYSCFG_DLYBSD3CR_RX_TAP_SEL                                        SYSCFG_DLYBSD3CR_RX_TAP_SEL_Msk                                                /*!< selection of TAP delay for RX clock */
#define SYSCFG_DLYBSD3CR_BYP_EN_Pos                                        (16U)
#define SYSCFG_DLYBSD3CR_BYP_EN_Msk                                        (0x1UL << SYSCFG_DLYBSD3CR_BYP_EN_Pos)                                          /*!< 0x00010000 */
#define SYSCFG_DLYBSD3CR_BYP_EN                                            SYSCFG_DLYBSD3CR_BYP_EN_Msk                                                    /*!< When 1, DLL bypass mode is enabled */
#define SYSCFG_DLYBSD3CR_BYP_CMD_Pos                                       (17U)
#define SYSCFG_DLYBSD3CR_BYP_CMD_Msk                                       (0x1FUL << SYSCFG_DLYBSD3CR_BYP_CMD_Pos)                                        /*!< 0x003E0000 */
#define SYSCFG_DLYBSD3CR_BYP_CMD                                           SYSCFG_DLYBSD3CR_BYP_CMD_Msk                                                   /*!< value of the delay unit when in DLL bypass mode */
#define SYSCFG_DLYBSD3CR_ANTIGLITCH_EN_Pos                                 (22U)
#define SYSCFG_DLYBSD3CR_ANTIGLITCH_EN_Msk                                 (0x1UL << SYSCFG_DLYBSD3CR_ANTIGLITCH_EN_Pos)                                   /*!< 0x00400000 */
#define SYSCFG_DLYBSD3CR_ANTIGLITCH_EN                                     SYSCFG_DLYBSD3CR_ANTIGLITCH_EN_Msk                                             /*!< When 1, the anti-glitch logic is enabled */

